[
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/29584-exam-professional-cloud-network-engineer-topic-1-question-1/",
    "question_text": "You need to restrict access to your Google Cloud load-balanced application so that only specific IP addresses can connect.\nWhat should you do?",
    "choices": {
      "D": "Label the backend instances \"application,\" and create a firewall rule with the target label \"application\" and the source IP range of the allowed clients and Google health check IP ranges.",
      "B": "Create a secure perimeter using VPC Service Controls, and mark the load balancer as a service restricted to the source IP range of the allowed clients and Google health check IP ranges.",
      "C": "Tag the backend instances \"application,\" and create a firewall rule with target tag \"application\" and the source IP range of the allowed clients and Google health check IP ranges.",
      "A": "Create a secure perimeter using the Access Context Manager feature of VPC Service Controls and restrict access to the source IP range of the allowed clients and Google health check IP ranges."
    },
    "id": 1
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/23211-exam-professional-cloud-network-engineer-topic-1-question-10/",
    "question_text": "You created a new VPC network named Dev with a single subnet. You added a firewall rule for the network Dev to allow HTTP traffic only and enabled logging.\nWhen you try to log in to an instance in the subnet via Remote Desktop Protocol, the login fails. You look for the Firewall rules logs in Stackdriver Logging, but you do not see any entries for blocked traffic. You want to see the logs for blocked traffic.\nWhat should you do?",
    "choices": {
      "C": "Create a new firewall rule to allow traffic from port 22, and enable logs.",
      "B": "Try connecting to the instance via SSH, and check the logs.",
      "A": "Check the VPC flow logs for the instance.",
      "D": "Create a new firewall rule with priority 65500 to deny all traffic, and enable logs."
    },
    "id": 2
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89728-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing the network architecture for your organization. Your organization has three developer teams: Web, App, and Database. All of the developer teams require access to Compute Engine instances to perform their critical tasks. You are part of a small network and security team that needs to provide network access to the developers. You need to maintain centralized control over network resources, including subnets, routes, and firewalls. You want to minimize operational overhead. How should you design this topology?",
    "choices": {
      "C": "Configure three Shared VPC host projects, each with a service project: one for Web, one for App, and one for Database.",
      "B": "Configure one VPC for Web, one VPC for App, and one VPC for Database. Configure HA VPN between each VPC.",
      "D": "Configure one VPC for Web, one VPC for App, and one VPC for Database. Use VPC Network Peering to connect all VPCs in a full mesh.",
      "A": "Configure a host project with a Shared VPC. Create service projects for Web, App, and Database."
    },
    "id": 3
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89737-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company has 10 separate Virtual Private Cloud (VPC) networks, with one VPC per project in a single region in Google Cloud. Your security team requires each VPC network to have private connectivity to the main on-premises location via a Partner Interconnect connection in the same region. To optimize cost and operations, the same connectivity must be shared with all projects. You must ensure that all traffic between different projects, on-premises locations, and the internet can be inspected using the same third-party appliances. What should you do?",
    "choices": {
      "C": "Consolidate all existing projects’ subnetworks into a single VPCreate separate VPC networks for on-premises and internet connectivity. Configure the third-party appliances with multiple interfaces, with each interface connected to a separate VPC network. Create the relevant routes on the third-party appliances and VPC networks.",
      "D": "Configure the third-party appliances with multiple interfaces. Create a hub VPC network for all projects, and create separate VPC networks for on-premises and internet connectivity. Create the relevant routes on the third-party appliances and VPC networks. Use VPC Network Peering to connect all projects’ VPC networks to the hub VPC. Export custom routes from the hub VPC and import on all projects’ VPC networks.",
      "B": "Configure the third-party appliances with multiple interfaces, with each interface connected to a separate VPC network. Create separate VPC networks for on-premises and internet connectivity. Create the relevant routes on the third-party appliances and VPC networks.",
      "A": "Configure the third-party appliances with multiple interfaces and specific Partner Interconnect VLAN attachments per project. Create the relevant routes on the third-party appliances and VPC networks."
    },
    "id": 4
  },
  {
    "answer": "B",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89555-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have just deployed your infrastructure on Google Cloud. You now need to configure the DNS to meet the following requirements:\n\n• Your on-premises resources should resolve your Google Cloud zones.\n• Your Google Cloud resources should resolve your on-premises zones.\n• You need the ability to resolve “.internal” zones provisioned by Google Cloud.\n",
    "choices": {
      "B": "Configure both an inbound server policy and outbound DNS forwarding zones with the target as the on-premises DNS resolver. Configure your on-premises DNS resolver to forward Google Cloud zone queries to Google Cloud's DNS resolver.",
      "A": "Configure an outbound server policy, and set your alternative name server to be your on-premises DNS resolver. Configure your on-premises DNS resolver to forward Google Cloud zone queries to Google's public DNS 8.8.8.8.",
      "D": "Configure Cloud DNS to DNS peer with your on-premises DNS resolver. Configure your on-premises DNS resolver to forward Google Cloud zone queries to Google's public DNS 8.8.8.8.",
      "C": "Configure an outbound DNS server policy, and set your alternative name server to be your on-premises DNS resolver. Configure your on-premises DNS resolver to forward Google Cloud zone queries to Google Cloud's DNS resolver."
    },
    "id": 5
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89736-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your organization uses a hub-and-spoke architecture with critical Compute Engine instances in your Virtual Private Clouds (VPCs). You are responsible for the design of Cloud DNS in Google Cloud. You need to be able to resolve Cloud DNS private zones from your on-premises data center and enable on-premises name resolution from your hub-and-spoke VPC design. What should you do?",
    "choices": {
      "C": "1. Configure a DNS policy in the spoke VPCs, and configure your on-premises DNS as an alternate DNS server.\n2. Configure the hub VPC with a private zone, and set up DNS peering to each of the spoke VPCs.",
      "A": "1. Configure a private DNS zone in the hub VPC, and configure DNS forwarding to the on-premises server.\n2. Configure DNS peering from the spoke VPCs to the hub VPC.",
      "B": "1. Configure a DNS policy in the hub VPC to allow inbound query forwarding from the spoke VPCs.\n2. Configure the spoke VPCs with a private zone, and set up DNS peering to the hub VPC.",
      "D": "1. Configure a DNS policy in the hub VPC, and configure the on-premises DNS as an alternate DNS server.\n2. Configure the spoke VPCs with a private zone, and set up DNS peering to the hub VPC."
    },
    "id": 6
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89733-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have a Cloud Storage bucket in Google Cloud project XYZ. The bucket contains sensitive data. You need to design a solution to ensure that only instances belonging to VPCs under project XYZ can access the data stored in this Cloud Storage bucket. What should you do?",
    "choices": {
      "D": "Configure Private Service Connect to privately access Cloud Storage from all VPCs under project XYZ.",
      "A": "Configure Private Google Access to privately access the Cloud Storage service using private IP addresses.",
      "B": "Configure a VPC Service Controls perimeter around project XYZ, and include storage.googleapis.com as a restricted service in the service perimeter.",
      "C": "Configure Cloud Storage with projectPrivate Access Control List (ACL) that gives permission to the project team based on their roles."
    },
    "id": 7
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89722-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are maintaining a Shared VPC in a host project. Several departments within your company have infrastructure in different service projects attached to the Shared VPC and use Identity and Access Management (IAM) permissions to manage the cloud resources in those projects. VPC Network Peering is also set up between the Shared VPC and a common services VPC that is not in a service project. Several users are experiencing failed connectivity between certain instances in different Shared VPC service projects and between certain instances and the internet. You need to validate the network configuration to identify whether a misconfiguration is the root cause of the problem. What should you do?",
    "choices": {
      "B": "Use Secure Shell (SSH) to connect to the affected Compute Engine instances, and run a series of PING tests to the other affected endpoints and the 8.8.8.8 IPv4 address.",
      "A": "Review the VPC audit logs in Cloud Logging for the affected instances.",
      "C": "Run Connectivity Tests from Network Intelligence Center to check connectivity between the affected endpoints in your network and the internet.",
      "D": "Enable VPC Flow Logs for all VPCs, and review the logs in Cloud Logging for the affected instances."
    },
    "id": 8
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89765-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your organization has Compute Engine instances in us-east1, us-west2, and us-central1. Your organization also has an existing Cloud Interconnect physical connection in the East Coast of the United States with a single VLAN attachment and Cloud Router in us-east1. You need to provide a design with high availability and ensure that if a region goes down, you still have access to all your other Virtual Private Cloud (VPC) subnets. You need to accomplish this in the most cost-effective manner possible. What should you do?",
    "choices": {
      "B": "1. Configure your VPC routing in global mode.\n2. Add an additional Cloud Interconnect VLAN attachment in the us-east1 region, and configure a Cloud Router in us-east1.",
      "D": "1. Configure your VPC routing in regional mode.\n2. Add additional Cloud Interconnect VLAN attachments in the us-west2 and us-central1 regions, and configure Cloud Routers in us-west2 and us-central1.",
      "C": "1. Configure your VPC routing in global mode.\n2. Add an additional Cloud Interconnect VLAN attachment in the us-west2 region, and configure a Cloud Router in us-west2.",
      "A": "1. Configure your VPC routing in regional mode.\n2. Add an additional Cloud Interconnect VLAN attachment in the us-east1 region, and configure a Cloud Router in us-east1."
    },
    "id": 9
  },
  {
    "answer": "B",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89738-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You recently configured Google Cloud Armor security policies to manage traffic to your application. You discover that Google Cloud Armor is incorrectly blocking some traffic to your application. You need to identity the web application firewall (WAF) rule that is incorrectly blocking traffic. What should you do?",
    "choices": {
      "B": "Enable HTTP(S) Load Balancing logging with sampling rate equal to 1, and view the logs in Cloud Logging.",
      "D": "Enable Google Cloud Armor audit logs, and view the logs on the Activity page in the Google Cloud Console.",
      "A": "Enable firewall logs, and view the logs in Firewall Insights.",
      "C": "Enable VPC Flow Logs, and view the logs in Cloud Logging."
    },
    "id": 10
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89498-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are the Organization Admin for your company. One of your engineers is responsible for setting up multiple host projects across multiple folders and sharing subnets with service projects. You need to enable the engineer's Identity and Access Management (IAM) configuration to complete their task in the fewest number of steps. What should you do?",
    "choices": {
      "C": "Set up the engineer with Compute Shared VPC Admin IAM role and Project IAM Admin role at the folder level.",
      "D": "Set up the engineer with Compute Shared VPC Admin IAM role and Project IAM Admin role at the organization level.",
      "B": "Set up the engineer with Compute Shared VPC Admin IAM role at the organization level.",
      "A": "Set up the engineer with Compute Shared VPC Admin IAM role at the folder level."
    },
    "id": 11
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89466-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You recently deployed Compute Engine instances in regions us-west1 and us-east1 in a Virtual Private Cloud (VPC) with default routing configurations. Your company security policy mandates that virtual machines (VMs) must not have public IP addresses attached to them. You need to allow your instances to fetch updates from the internet while preventing external access. What should you do?",
    "choices": {
      "A": "Create a Cloud NAT gateway and Cloud Router in both us-west1 and us-east1.",
      "D": "Create a firewall rule that allows egress to destination 0.0.0.0/0.",
      "B": "Create a single global Cloud NAT gateway and global Cloud Router in the VPC.",
      "C": "Change the instances’ network interface external IP address from None to Ephemeral."
    },
    "id": 12
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/23801-exam-professional-cloud-network-engineer-topic-1-question-11/",
    "question_text": "You are trying to update firewall rules in a shared VPC for which you have been assigned only Network Admin permissions. You cannot modify the firewall rules.\nYour organization requires using the least privilege necessary.\nWhich level of permissions should you request?",
    "choices": {
      "A": "Security Admin privileges from the Shared VPC Admin.",
      "D": "Organization Admin privileges from the Organization Admin.",
      "B": "Service Project Admin privileges from the Shared VPC Admin.",
      "C": "Shared VPC Admin privileges from the Organization Admin."
    },
    "id": 13
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89479-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing a new global application using Compute Engine instances that will be exposed by a global HTTP(S) load balancer. You need to secure your application from distributed denial-of-service and application layer (layer 7) attacks. What should you do?",
    "choices": {
      "A": "Configure VPC Service Controls and create a secure perimeter. Define fine-grained perimeter controls and enforce that security posture across your Google Cloud services and projects.",
      "C": "Configure VPC firewall rules to protect the Compute Engine instances against distributed denial-of-service attacks.",
      "B": "Configure a Google Cloud Armor security policy in your project, and attach it to the backend service to secure the application.",
      "D": "Configure hierarchical firewall rules for the global HTTP(S) load balancer public IP address at the organization level."
    },
    "id": 14
  },
  {
    "answer": "C",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89476-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your organization's security policy requires that all internet-bound traffic return to your on-premises data center through HA VPN tunnels before egressing to the internet, while allowing virtual machines (VMs) to leverage private Google APIs using private virtual IP addresses 199.36.153.4/30. You need to configure the routes to enable these traffic flows. What should you do?",
    "choices": {
      "D": "Announce a 0.0.0.0/0 route from your on-premises router with a MED of 500. Configure another custom route 199.36.153.4/30 with a priority of 1000 whose next hop is the VPN tunnel back to the on-premises data center.",
      "B": "Configure a custom route 0.0.0.0/0 with a priority of 1000 whose next hop is the internet gateway. Configure another custom route 199.36.153.4/30 with a priority of 500 whose next hop is the VPN tunnel back to the on-premises data center.",
      "A": "Configure a custom route 0.0.0.0/0 with a priority of 500 whose next hop is the default internet gateway. Configure another custom route 199.36.153.4/30 with priority of 1000 whose next hop is the VPN tunnel back to the on-premises data center.",
      "C": "Announce a 0.0.0.0/0 route from your on-premises router with a MED of 1000. Configure a custom route 199.36.153.4/30 with a priority of 1000 whose next hop is the default internet gateway."
    },
    "id": 15
  },
  {
    "answer": "D",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89787-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company has defined a resource hierarchy that includes a parent folder with subfolders for each department. Each department defines their respective project and VPC in the assigned folder and has the appropriate permissions to create Google Cloud firewall rules. The VPCs should not allow traffic to flow between them. You need to block all traffic from any source, including other VPCs, and delegate only the intra-VPC firewall rules to the respective departments. What should you do?",
    "choices": {
      "B": "Create a VPC firewall rule in each VPC to block traffic from any source, with priority 1000.",
      "D": "Create two hierarchical firewall policies per department's folder with two rules in each: a high-priority rule that matches traffic from the private CIDRs assigned to the respective VPC and sets the action to goto_next, and another lower-priority rule that blocks traffic from any other source.",
      "C": "Create two hierarchical firewall policies per department's folder with two rules in each: a high-priority rule that matches traffic from the private CIDRs assigned to the respective VPC and sets the action to allow, and another lower-priority rule that blocks traffic from any other source.",
      "A": "Create a VPC firewall rule in each VPC to block traffic from any source, with priority 0."
    },
    "id": 16
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89478-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have two Google Cloud projects in a perimeter to prevent data exfiltration. You need to move a third project inside the perimeter; however, the move could negatively impact the existing environment. You need to validate the impact of the change. What should you do?",
    "choices": {
      "C": "Monitor the Resource Manager audit logs inside the perimeter.",
      "A": "Enable Firewall Rules Logging inside the third project.",
      "B": "Modify the existing VPC Service Controls policy to include the new project in dry run mode.",
      "D": "Enable VPC Flow Logs inside the third project, and monitor the logs for negative impact."
    },
    "id": 17
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89790-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are configuring an HA VPN connection between your Virtual Private Cloud (VPC) and on-premises network. The VPN gateway is named VPN_GATEWAY_1. You need to restrict VPN tunnels created in the project to only connect to your on-premises VPN public IP address: 203.0.113.1/32. What should you do?",
    "choices": {
      "D": "Configure an access control list on the peer VPN gateway to deny all traffic except 203.0.113.1/32, and attach it to the primary external interface.",
      "C": "Configure a Google Cloud Armor security policy, and create a policy rule to allow 203.0.113.1/32.",
      "A": "Configure a firewall rule accepting 203.0.113.1/32, and set a target tag equal to VPN_GATEWAY_1.",
      "B": "Configure the Resource Manager constraint constraints/compute.restrictVpnPeerIPs to use an allowList consisting of only the 203.0.113.1/32 address."
    },
    "id": 18
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89779-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company has recently installed a Cloud VPN tunnel between your on-premises data center and your Google Cloud Virtual Private Cloud (VPC). You need to configure access to the Cloud Functions API for your on-premises servers. The configuration must meet the following requirements:\n\n• Certain data must stay in the project where it is stored and not be exfiltrated to other projects.\n• Traffic from servers in your data center with RFC 1918 addresses do not use the internet to access Google Cloud APIs.\n• All DNS resolution must be done on-premises.\n• The solution should only provide access to APIs that are compatible with VPC Service Controls.\n",
    "choices": {
      "B": "1. Create an A record for restricted.googleapis.com using the 199.36.153.4/30 address range.\n2. Create a CNAME record for *.googleapis.com that points to the A record.\n3. Configure your on-premises routers to use the Cloud VPN tunnel as the next hop for the addresses you used in the A record.\n4. Configure your on-premises firewalls to allow traffic to the restricted.googleapis.com addresses.",
      "C": "1. Create an A record for restricted.googleapis.com using the 199.36.153.4/30 address range.\n2. Create a CNAME record for *.googleapis.com that points to the A record.\n3. Configure your on-premises routers to use the Cloud VPN tunnel as the next hop for the addresses you used in the A record.\n4. Remove the default internet gateway from the VPC where your Cloud VPN tunnel terminates.",
      "A": "1. Create an A record for private.googleapis.com using the 199.36.153.8/30 address range.\n2. Create a CNAME record for *.googleapis.com that points to the A record.\n3. Configure your on-premises routers to use the Cloud VPN tunnel as the next hop for the addresses you used in the A record.\n4. Remove the default internet gateway from the VPC where your Cloud VPN tunnel terminates.",
      "D": "1. Create an A record for private.googleapis.com using the 199.36.153.8/30 address range.\n2. Create a CNAME record for *.googleapis.com that points to the A record.\n3. Configure your on-premises routers to use the Cloud VPN tunnel as the next hop for the addresses you used in the A record.\n4. Configure your on-premises firewalls to allow traffic to the private.googleapis.com addresses."
    },
    "id": 19
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89604-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You need to configure a Google Kubernetes Engine (GKE) cluster. The initial deployment should have 5 nodes with the potential to scale to 10 nodes. The maximum number of Pods per node is 8. The number of services could grow from 100 to up to 1024. How should you design the IP schema to optimally meet this requirement?",
    "choices": {
      "A": "Configure a /28 primary IP address range for the node IP addresses. Configure a /25 secondary IP range for the Pods. Configure a /22 secondary IP range for the Services.",
      "D": "Configure a /28 primary IP address range for the node IP addresses. Configure a /24 secondary IP range for the Pads. Configure a /22 secondary IP range for the Services.",
      "C": "Configure a /28 primary IP address range for the node IP addresses. Configure a /28 secondary IP range for the Pods. Configure a /21 secondary IP range for the Services.",
      "B": "Configure a /28 primary IP address range for the node IP addresses. Configure a /25 secondary IP range for the Pods. Configure a /21 secondary IP range for the Services."
    },
    "id": 20
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89559-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are migrating a three-tier application architecture from on-premises to Google Cloud. As a first step in the migration, you want to create a new Virtual Private Cloud (VPC) with an external HTTP(S) load balancer. This load balancer will forward traffic back to the on-premises compute resources that run the presentation tier. You need to stop malicious traffic from entering your VPC and consuming resources at the edge, so you must configure this policy to filter IP addresses and stop cross-site scripting (XSS) attacks. What should you do?",
    "choices": {
      "C": "Create a Google Cloud Armor policy, and apply it to a backend service that uses an internet network endpoint group (NEG) backend.",
      "D": "Create a VPC firewall ruleset, and apply it to all instances in unmanaged instance groups.",
      "B": "Create a hierarchical firewall ruleset, and apply it to the VPC's parent organization resource node.",
      "A": "Create a Google Cloud Armor policy, and apply it to a backend service that uses an unmanaged instance group backend."
    },
    "id": 21
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89842-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You just finished your company’s migration to Google Cloud and configured an architecture with 3 Virtual Private Cloud (VPC) networks: one for Sales, one for Finance, and one for Engineering. Every VPC contains over 100 Compute Engine instances, and now developers using instances in the Sales VPC and the Finance VPC require private connectivity between each other. You need to allow communication between Sales and Finance without compromising performance or security. What should you do?",
    "choices": {
      "D": "Configure Cloud NAT and a Cloud Router in the Sales and Finance VPCs.",
      "B": "Configure the instances that require communication between each other with an external IP address.",
      "A": "Configure an HA VPN gateway between the Finance VPC and the Sales VPC.",
      "C": "Create a VPC Network Peering connection between the Finance VPC and the Sales VPC."
    },
    "id": 22
  },
  {
    "answer": "D",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89598-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have provisioned a Partner Interconnect connection to extend connectivity from your on-premises data center to Google Cloud. You need to configure a Cloud Router and create a VLAN attachment to connect to resources inside your VPC. You need to configure an Autonomous System number (ASN) to use with the associated Cloud Router and create the VLAN attachment.\n",
    "choices": {
      "A": "Use a 4-byte private ASN 4200000000-4294967294.",
      "B": "Use a 2-byte private ASN 64512-65535.",
      "C": "Use a public Google ASN 15169.",
      "D": "Use a public Google ASN 16550."
    },
    "id": 23
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/26029-exam-professional-cloud-network-engineer-topic-1-question-12/",
    "question_text": "You want to create a service in GCP using IPv6.\nWhat should you do?",
    "choices": {
      "D": "Configure an internal load balancer with the designated IPv6 address.",
      "B": "Configure a TCP Proxy with the designated IPv6 address.",
      "C": "Configure a global load balancer with the designated IPv6 address.",
      "A": "Create the instance with the designated IPv6 address."
    },
    "id": 24
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89844-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are configuring a new application that will be exposed behind an external load balancer with both IPv4 and IPv6 addresses and support TCP pass-through on port 443. You will have backends in two regions: us-west1 and us-east1. You want to serve the content with the lowest possible latency while ensuring high availability and autoscaling. Which configuration should you use?",
    "choices": {
      "D": "Use Network Load Balancing in both regions, and use DNS-based load balancing to direct traffic to the closest region.",
      "C": "Use global external HTTP(S) Load Balancing with backends in both regions.",
      "A": "Use global SSL Proxy Load Balancing with backends in both regions.",
      "B": "Use global TCP Proxy Load Balancing with backends in both regions."
    },
    "id": 25
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89848-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "In your project my-project, you have two subnets in a Virtual Private Cloud (VPC): subnet-a with IP range 10.128.0.0/20 and subnet-b with IP range 172.16.0.0/24. You need to deploy database servers in subnet-a. You will also deploy the application servers and web servers in subnet-b. You want to configure firewall rules that only allow database traffic from the application servers to the database servers. What should you do?",
    "choices": {
      "C": "Create service accounts sa-app@my-project.iam.gserviceaccount.com and sa-db@my-project.iam.gserviceaccount.com. Associate the service account sa-app with the application servers, and associate the service account sa-db with the database servers. Run the following command: gcloud compute firewall-rules create app-db-firewall-ru\n--allow TCP:3306 \\\n--source-ranges 10.128.0.0/20 \\\n--source-service-accounts sa-app@my-\nproject.iam.gserviceaccount.com \\\n--target-service-accounts sa-db@my-\nproject.iam.gserviceaccount.com",
      "D": "Create network tags app-server and db-server. Add the app-server tag to the application servers, and add the db-server tag to the database servers. Run the following command: gcloud compute firewall-rules create app-db-firewall-rule \\\n--action allow \\\n--direction ingress \\\n--rules tcp:3306 \\\n--source-ranges 10.128.0.0/20 \\\n--source-tags app-server \\\n--target-tags db-server",
      "A": "Create network tag app-server and service account sa-db@my-project.iam.gserviceaccount.com. Add the tag to the application servers, and associate the service account with the database servers. Run the following command: gcloud compute firewall-rules create app-db-firewall-rule \\\n--action allow \\\n--direction ingress \\\n--rules top:3306 \\\n--source-tags app-server \\\n--target-service-accounts sa-db@my-\nproject.iam.gserviceaccount.com",
      "B": "Create service accounts sa-app@my-project.iam.gserviceaccount.com and sa-db@my-project.iam.gserviceaccount.com. Associate service account sa-app with the application servers, and associate the service account sa-db with the database servers. Run the following command: gcloud compute firewall-rules create app-db-firewall-ru\n--allow TCP:3306 \\\n--source-service-accounts sa-app@democloud-idp-\ndemo.iam.gserviceaccount.com \\\n--target-service-accounts sa-db@my-\nproject.iam.gserviceaccount.com"
    },
    "id": 26
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89846-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are planning a large application deployment in Google Cloud that includes on-premises connectivity. The application requires direct connectivity between workloads in all regions and on-premises locations without address translation, but all RFC 1918 ranges are already in use in the on-premises locations. What should you do?",
    "choices": {
      "D": "Use non-RFC 1918 ranges with a single global VPC.",
      "B": "Use overlapping RFC 1918 ranges with multiple isolated VPC networks.",
      "A": "Use multiple VPC networks with a transit network using VPC Network Peering.",
      "C": "Use overlapping RFC 1918 ranges with multiple isolated VPC networks and Cloud NAT."
    },
    "id": 27
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89845-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company's security team wants to limit the type of inbound traffic that can reach your web servers to protect against security threats. You need to configure the firewall rules on the web servers within your Virtual Private Cloud (VPC) to handle HTTP and HTTPS web traffic for TCP only. What should you do?",
    "choices": {
      "C": "Create an allow on match ingress firewall rule with the target tag “web-server” to allow all IP addresses for TCP ports 80 and 443.",
      "D": "Create an allow on match egress firewall rule with the target tag “web-server\" to allow web server IP addresses for TCP ports 80 and 443.",
      "B": "Create an allow on match egress firewall rule with the target tag “web-server” to allow all IP addresses for TCP port 80.",
      "A": "Create an allow on match ingress firewall rule with the target tag “web-server” to allow all IP addresses for TCP port 80."
    },
    "id": 28
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89540-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You successfully provisioned a single Dedicated Interconnect. The physical connection is at a colocation facility closest to us-west2. Seventy-five percent of your workloads are in us-east4, and the remaining twenty-five percent of your workloads are in us-central1. All workloads have the same network traffic profile. You need to minimize data transfer costs when deploying VLAN attachments. What should you do?",
    "choices": {
      "C": "Order a new Dedicated Interconnect for a colocation facility closest to us-east4, and use VPC global routing to access workloads in us-central1.",
      "D": "Order a new Dedicated Interconnect for a colocation facility closest to us-central1, and use VPC global routing to access workloads in us-east4.",
      "B": "Keep the existing Dedicated Interconnect. Deploy a VLAN attachment to a Cloud Router in us-east4, and deploy another VLAN attachment to a Cloud Router in us-central1.",
      "A": "Keep the existing Dedicated interconnect. Deploy a VLAN attachment to a Cloud Router in us-west2, and use VPC global routing to access workloads in us-east4 and us-central1."
    },
    "id": 29
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89850-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing a hybrid cloud environment. Your Google Cloud environment is interconnected with your on-premises network using HA VPN and Cloud Router in a central transit hub VPC. The Cloud Router is configured with the default settings. Your on-premises DNS server is located at 192.168.20.88. You need to ensure that your Compute Engine resources in multiple spoke VPCs can resolve on-premises private hostnames using the domain corp.altostrat.com while also resolving Google Cloud hostnames. You want to follow Google-recommended practices. What should you do?",
    "choices": {
      "D": "1. Create a private forwarding zone in Cloud DNS for ‘corp altostrat.com’ called corp-altostrat-com that points to 192. 168.20.88. Associate the zone with the hub VPC.\n2. Create a private peering zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com associated with the spoke VPCs, with the hub VPC as the target.\n3. Sat a custom route advertisement on the Cloud Router for 35.199.192.0/19.\n4. Create a hub and spoke VPN deployment in each spoke VPC to connect back to the hub VPC.",
      "B": "1. Create a private forwarding zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com that points to 192.168.20.88.\n2. Associate the zone with the hub VPC. Create a private peering zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com associated with the spoke PCs, with the hub VPC as the target.\n3. Set a custom route advertisement on the Cloud Router for 35.199.192.0/19.",
      "C": "1. Create a private forwarding zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com that points to 192.168.20.88. Associate the zone with the hub VPC.\n2. Create a private peering zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com associated with the spoke VPCs, with the hub VPC as the target.\n3. Set a custom route advertisement on the Cloud Router for 35.199.192.0/19.\n4. Create a hub-and-spoke VPN deployment in each spoke VPC to connect back to the on-premises network directly.",
      "A": "1. Create a private forwarding zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com that points to 192.168.20.88. Associate the zone with the hub VPC.\n2. Create a private peering zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com associated with the spoke VPCs, with the hub VPC as the target.\n3. Set a custom route advertisement on the Cloud Router for 35.199.192.0/19.\n4. Configure VPC peering in the spoke VPCs to peer with the hub VPC."
    },
    "id": 30
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89852-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have the following firewall ruleset applied to all instances in your Virtual Private Cloud (VPC):\n\n//IMG//\n\n\nYou need to update the firewall rule to add the following rule to the ruleset:\n\n//IMG//\n\n",
    "choices": {
      "D": "Assign the compute.orgSecurityPolicyAdmin and logging.bucketWriter role to the new user account. Apply the new firewall rule with a priority of 150.",
      "B": "Assign the compute.securityAdmin and logging.bucketWriter role to the new user account. Apply the new firewall rule with a priority of 150.",
      "C": "Assign the compute.orgSecurityPolicyAdmin and logging.viewer role to the new user account. Apply the new firewall rule with a priority of 50.",
      "A": "Assign the compute.securityAdmin and logging.viewer rule to the new user account. Apply the new firewall rule with a priority of 50."
    },
    "id": 31
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89900-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your organization has a single project that contains multiple Virtual Private Clouds (VPCs). You need to secure API access to your Cloud Storage buckets and BigQuery datasets by allowing API access only from resources in your corporate public networks. What should you do?",
    "choices": {
      "B": "Create a VPC Service Controls perimeter for your project with an access context policy that allows your corporate public network IP ranges.",
      "D": "Create a VPC Service Controls perimeter for each VPC with an access context policy that allows your corporate public network IP ranges.",
      "C": "Create a firewall rule to block API access to Cloud Storage and BigQuery from unauthorized networks.",
      "A": "Create an access context policy that allows your VPC and corporate public network IP ranges, and then attach the policy to Cloud Storage and BigQuery."
    },
    "id": 32
  },
  {
    "answer": "DE",
    "answer_ET": "AB",
    "url": "https://www.examtopics.com/discussions/google/view/89560-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company has provisioned 2000 virtual machines (VMs) in the private subnet of your Virtual Private Cloud (VPC) in the us-east1 region. You need to configure each VM to have a minimum of 128 TCP connections to a public repository so that users can download software updates and packages over the internet. You need to implement a Cloud NAT gateway so that the VMs are able to perform outbound NAT to the internet. You must ensure that all VMs can simultaneously connect to the public repository and download software updates and packages. Which two methods can you use to accomplish this? (Choose two.)",
    "choices": {
      "E": "Configure the NAT gateway in manual allocation mode, allocate 4 NAT IP addresses, and update the minimum number of ports per VM to 128.",
      "D": "Use the default Cloud NAT gateway to automatically scale to the required number of NAT IP addresses, and update the minimum number of ports per VM to 128.",
      "A": "Configure the NAT gateway in manual allocation mode, allocate 2 NAT IP addresses, and update the minimum number of ports per VM to 256.",
      "C": "Use the default Cloud NAT gateway's NAT proxy to dynamically scale using a single NAT IP address.",
      "B": "Create a second Cloud NAT gateway with the default minimum number of ports configured per VM to 64."
    },
    "id": 33
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89599-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have the following routing design. You discover that Compute Engine instances in Subnet-2 in the asia-southeast1 region cannot communicate with compute resources on-premises. What should you do?\n\n//IMG//",
    "choices": {
      "D": "Add a second Border Gateway Protocol (BGP) session to the Cloud Router.",
      "C": "Change the VPC dynamic routing mode to Global.",
      "B": "Enable IP forwarding in the asia-southeast1 region.",
      "A": "Configure a custom route advertisement on the Cloud Router."
    },
    "id": 34
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/29367-exam-professional-cloud-network-engineer-topic-1-question-13/",
    "question_text": "You want to deploy a VPN Gateway to connect your on-premises network to GCP. You are using a non BGP-capable on-premises VPN device. You want to minimize downtime and operational overhead when your network grows. The device supports only IKEv2, and you want to follow Google-recommended practices.\nWhat should you do?",
    "choices": {
      "A": "\"¢ Create a Cloud VPN instance. \"¢ Create a policy-based VPN tunnel per subnet. \"¢ Configure the appropriate local and remote traffic selectors to match your local and remote networks. \"¢ Create the appropriate static routes.",
      "B": "\"¢ Create a Cloud VPN instance. \"¢ Create a policy-based VPN tunnel. \"¢ Configure the appropriate local and remote traffic selectors to match your local and remote networks. \"¢ Configure the appropriate static routes.",
      "D": "\"¢ Create a Cloud VPN instance. \"¢ Create a route-based VPN tunnel. \"¢ Configure the appropriate local and remote traffic selectors to 0.0.0.0/0. \"¢ Configure the appropriate static routes.",
      "C": "\"¢ Create a Cloud VPN instance. \"¢ Create a route-based VPN tunnel. \"¢ Configure the appropriate local and remote traffic selectors to match your local and remote networks. \"¢ Configure the appropriate static routes."
    },
    "id": 35
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89901-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing a hybrid cloud environment for your organization. Your Google Cloud environment is interconnected with your on-premises network using Cloud HA VPN and Cloud Router. The Cloud Router is configured with the default settings. Your on-premises DNS server is located at 192.168.20.88 and is protected by a firewall, and your Compute Engine resources are located at 10.204.0.0/24. Your Compute Engine resources need to resolve on-premises private hostnames using the domain corp.altostrat.com while still resolving Google Cloud hostnames. You want to follow Google-recommended practices. What should you do?",
    "choices": {
      "D": "1. Create a private zone in Cloud DNS for ‘corp altostrat.com’ called corp-altostrat-com.\n2. Configure DNS Server Policies and create a policy with Alternate DNS servers to 192.168.20.88.\n3. Configure your on-premises firewall to accept traffic from 35.199.192.0/19.\n4. Set a custom route advertisement on the Cloud Router for 35.199.192.0/19.",
      "A": "1. Create a private forwarding zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com that points to 192.168.20.88.\n2. Configure your on-premises firewall to accept traffic from 10.204.0.0/24.\n3. Set a custom route advertisement on the Cloud Router for 10.204.0.0/24",
      "C": "1. Create a private forwarding zone in Cloud DNS for ‘corp .altostrat.com’ called corp-altostrat-com that points to 192.168.20.88.\n2. Configure your on-premises firewall to accept traffic from 10.204.0.0/24.\n3. Modify the /etc/resolv conf file on your Compute Engine instances to point to 192.168.20 88",
      "B": "1. Create a private forwarding zone in Cloud DNS for ‘corp.altostrat.com’ called corp-altostrat-com that points to 192.168 20.88.\n2. Configure your on-premises firewall to accept traffic from 35.199.192.0/19\n3. Set a custom route advertisement on the Cloud Router for 35.199.192.0/19."
    },
    "id": 36
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89565-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company has a single Virtual Private Cloud (VPC) network deployed in Google Cloud with on-premises connectivity already in place. You are deploying a new application using Google Kubernetes Engine (GKE), which must be accessible only from the same VPC network and on-premises locations. You must ensure that the GKE control plane is exposed to a predefined list of on-premises subnets through private connectivity only. What should you do?",
    "choices": {
      "B": "Create a GKE private cluster with a public endpoint for the control plane. Configure VPC Networking Peering export/import routes and custom route advertisements on the Cloud Routers.",
      "C": "Create a GKE private cluster with a private endpoint for the control plane. Configure authorized networks to specify the desired on-premises subnets.",
      "D": "Create a GKE public cluster. Configure authorized networks to specify the desired on-premises subnets.",
      "A": "Create a GKE private cluster with a private endpoint for the control plane. Configure VPC Networking Peering export/import routes and custom route advertisements on the Cloud Routers. Configure authorized networks to specify the desired on-premises subnets."
    },
    "id": 37
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89902-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You built a web application with several containerized microservices. You want to run those microservices on Cloud Run. You must also ensure that the services are highly available to your customers with low latency. What should you do?",
    "choices": {
      "A": "Deploy the Cloud Run services to multiple availability zones. Create a global TCP load balancer. Add the Cloud Run endpoints to its backend service.",
      "D": "Deploy the Cloud Run services to multiple regions. Configure a round-robin A record in Cloud DNS.",
      "C": "Deploy the Cloud Run services to multiple availability zones. Create Cloud Endpoints that point to the services. Create a global HTTPS load balancer, and attach the Cloud Endpoints to its backend",
      "B": "Deploy the Cloud Run services to multiple regions. Create serverless network endpoint groups (NEGs) that point to the services. Create a global HTTPS load balancer, and attach the serverless NEGs as backend services of the load balancer."
    },
    "id": 38
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89904-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have an HA VPN connection with two tunnels running in active/passive mode between your Virtual Private Cloud (VPC) and on-premises network. Traffic over the connection has recently increased from 1 gigabit per second (Gbps) to 4 Gbps, and you notice that packets are being dropped. You need to configure your VPN connection to Google Cloud to support 4 Gbps. What should you do?",
    "choices": {
      "A": "Configure the remote autonomous system number (ASN) to 4096.",
      "B": "Configure a second Cloud Router to scale bandwidth in and out of the VPC.",
      "D": "Configure a second set of active/passive VPN tunnels.",
      "C": "Configure the maximum transmission unit (MTU) to its highest supported value."
    },
    "id": 39
  },
  {
    "answer": "D",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89905-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You recently deployed two network virtual appliances in us-central1. Your network appliances provide connectivity to your on-premises network, 10.0.0.0/8. You need to configure the routing for your Virtual Private Cloud (VPC). Your design must meet the following requirements:\n\n• All access to your on-premises network must go through the network virtual appliances.\n• Allow on-premises access in the event of a single network virtual appliance failure.\n• Both network virtual appliances must be used simultaneously.\n",
    "choices": {
      "A": "Configure two routes for 10.0.0.0/8 with different priorities, each pointing to separate network virtual appliances.",
      "C": "Configure a network load balancer for the two network virtual appliances. Configure a route for 10.0.0.0/8 with the network load balancer as the next hop.",
      "D": "Configure an internal TCP/UDP load balancer with the two network virtual appliances as backends. Configure a route for 10.0.0.0/8 with the internal load balancer as the next hop.",
      "B": "Configure an internal HTTP(S) load balancer with the two network virtual appliances as backends. Configure a route for 10.0.0.0/8 with the internal HTTP(S) load balancer as the next hop."
    },
    "id": 40
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89949-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are responsible for enabling Private Google Access for the virtual machine (VM) instances in your Virtual Private Cloud (VPC) to access Google APIs. All VM instances have only a private IP address and need to access Cloud Storage. You need to ensure that all VM traffic is routed back to your on-premises data center for traffic scrubbing via your existing Cloud Interconnect connection. However, VM traffic to Google APIs should remain in the VPC. What should you do?",
    "choices": {
      "B": "1. Delete the default route in your VPC and configure your on-premises router to advertise 0.0.0.0/0 via Border Gateway Protocol (BGP).\n2. Create a public Cloud DNS zone with a CNAME for *.google.com to private googleapis com, create a CNAME for * googleapis.com to private googleapis com, and create an A record for Private googleapis.com that resolves to the addresses in 199.36.153 8/30.\n3. Create a static route in your VPC for the range 199 .36.153.8/30 with the default internet gateway as the next hop.",
      "A": "1. Delete the default route in your VPC.\n2. Create a private Cloud DNS zone for googleapis.com, create a CNAME for *.googleapis.com to restricted googleapis.com, and create an A record for restricted googleapis com that resolves to the addresses in 199.36.153.4/30.\n3. Create a static route in your VPC for the range 199.36.153.4/30 with the default internet gateway as the next hop.",
      "C": "1. Configure your on-premises router to advertise 0.0.0.0/0 via Border Gateway Protocol (BGP) with a lower priority (MED) than the default VPC route.\n2. Create a private Cloud DNS zone for googleapis.com, create a CNAME for * googieapis.com to private googleapis com, and create an A record for private.googleapis.com that resolves to the addresses in 199 .36.153.8/30.\n3. Create a static route in your VPC for the range 199.36. 153.8/30 with the default internet gateway as the next hop.",
      "D": "1. Delete the default route in your VPC and configure your on-premises router to advertise 0.0.0.0/0 via Border Gateway Protocol (BGP).\n2. Create a private Cloud DNS zone for googleapis.com, create a CNAME for * googieapis.com to Private googleapis.com, and create an A record for private.googleapis.com that resolves to the addresses in 199.36.153.8/30.\n3. Create a static route in your VPC for the range 199.36.153.8/30 with the default internet gateway as the next hop."
    },
    "id": 41
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89947-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing a hub-and-spoke network architecture for your company’s cloud-based environment. You need to make sure that all spokes are peered with the hub. The spokes must use the hub's virtual appliance for internet access. The virtual appliance is configured in high-availability mode with two instances using an internal load balancer with IP address 10.0.0.5. What should you do?",
    "choices": {
      "C": "1. Create two default routes in the hub VPC that point to the next hop instances of the virtual appliances.\n2. Delete the default internet gateway route in the hub VPC, and create a new higher-priority route that is tagged only to the appliances with a next hop of the default internet gateway.\n3. Export the custom routes in the hub. Import the custom routes in the spokes.",
      "B": "1. Create a default route in the hub VPC that points to IP address 10.0.0.5.\n2. Delete the default internet gateway route in the hub VPC, and create a new higher-priority route that is tagged only to the appliances with a next hop of the default internet gateway.\n3. Export the custom routes in the hub. Import the custom routes in the spokes.\n4. Delete the default internet gateway route of the spokes.",
      "D": "1. Create a default route in the hub VPC that points to IP address 10.0.0.5.\n2. Delete the default internet gateway route in the hub VPC, and create a new higher-priority route that is tagged only to the appliances with a next hop of the default internet gateway.\n3. Create a new route in the spoke VPC that points to IP address 10.0.0.5.",
      "A": "1. Create a default route in the hub VPC that points to IP address 10.0.0.5.\n2. Delete the default internet gateway route in the hub VPC, and create a new higher-priority route that is tagged only to the appliances with a next hop of the default internet gateway.\n3. Export the custom routes in the hub.\n4. Import the custom routes in the spokes."
    },
    "id": 42
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89963-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You configured Cloud VPN with dynamic routing via Border Gateway Protocol (BGP). You added a custom route to advertise a network that is reachable over the VPN tunnel. However, the on-premises clients still cannot reach the network over the VPN tunnel. You need to examine the logs in Cloud Logging to confirm that the appropriate routers are being advertised over the VPN tunnel. Which filter should you use in Cloud Logging to examine the logs?",
    "choices": {
      "D": "resource.type= “vpn_gateway”",
      "A": "resource.type= “gce_router”",
      "C": "resource.type= “vpn_tunnel”",
      "B": "resource.type= “gce_network_region”"
    },
    "id": 43
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89539-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company has a single Virtual Private Cloud (VPC) network deployed in Google Cloud with access from on-premises locations using Cloud Interconnect connections. Your company must be able to send traffic to Cloud Storage only through the Interconnect links while accessing other Google APIs and services over the public internet. What should you do?",
    "choices": {
      "D": "Use Private Google Access, with private.googleapis.com virtual IP addresses for Cloud Storage and restricted.googleapis.com virtual IP addresses for all other Google APIs and services.",
      "C": "Use Private Google Access, with restricted.googleapis.com virtual IP addresses for Cloud Storage and private.googleapis.com for all other Google APIs and services.",
      "B": "Use Private Service Connect to access Cloud Storage, and use the default public domains for all other Google APIs and services.",
      "A": "Use the default public domains for all Google APIs and services."
    },
    "id": 44
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89966-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your organization has a Google Cloud Virtual Private Cloud (VPC) with subnets in us-east1, us-west4, and europe-west4 that use the default VPC configuration. Employees in a branch office in Europe need to access the resources in the VPC using HA VPN. You configured the HA VPN associated with the Google Cloud VPC for your organization with a Cloud Router deployed in europe-west4. You need to ensure that the users in the branch office can quickly and easily access all resources in the VPC. What should you do?",
    "choices": {
      "C": "Configure the VPC dynamic routing mode to Global.",
      "A": "Create custom advertised routes for each subnet.",
      "D": "Set the advertised routes to Global for the Cloud Router.",
      "B": "Configure each subnet’s VPN connections to use Cloud VPN to connect to the branch office."
    },
    "id": 45
  },
  {
    "answer": "BC",
    "answer_ET": "CD",
    "url": "https://www.examtopics.com/discussions/google/view/25852-exam-professional-cloud-network-engineer-topic-1-question-14/",
    "question_text": "Your company just completed the acquisition of Altostrat (a current GCP customer). Each company has a separate organization in GCP and has implemented a custom DNS solution. Each organization will retain its current domain and host names until after a full transition and architectural review is done in one year.\nThese are the assumptions for both GCP environments.\n\"¢ Each organization has enabled full connectivity between all of its projects by using Shared VPC.\n\"¢ Both organizations strictly use the 10.0.0.0/8 address space for their instances, except for bastion hosts (for accessing the instances) and load balancers for serving web traffic.\n\"¢ There are no prefix overlaps between the two organizations.\n\"¢ Both organizations already have firewall rules that allow all inbound and outbound traffic from the 10.0.0.0/8 address space.\n\"¢ Neither organization has Interconnects to their on-premises environment.\nYou want to integrate networking and DNS infrastructure of both organizations as quickly as possible and with minimal downtime.\nWhich two steps should you take? (Choose two.)",
    "choices": {
      "A": "Provision Cloud Interconnect to connect both organizations together.",
      "E": "Create a third organization with a new host project, and attach all projects from your company and Altostrat to it using shared VPC.",
      "D": "Use Cloud DNS to create A records of all VMs and resources across all projects in both organizations.",
      "C": "Connect VPCs in both organizations using Cloud VPN together with Cloud Router.",
      "B": "Set up some variant of DNS forwarding and zone transfers in each organization."
    },
    "id": 46
  },
  {
    "answer": "A",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89538-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your organization uses a Shared VPC architecture with a host project and three service projects. You have Compute Engine instances that reside in the service projects. You have critical workloads in your on-premises data center. You need to ensure that the Google Cloud instances can resolve on-premises hostnames via the Dedicated Interconnect you deployed to establish hybrid connectivity. What should you do?",
    "choices": {
      "D": "1.Configure a Cloud DNS private zone in the host project of the Shared VPC.\n2. Set up DNS forwarding to your Google Cloud private zone on your on-premises DNS servers to point to the inbound forwarder IP address in your host project.\n3. Configure a DNS policy in the Shared VPC to allow inbound query forwarding with your on-premises DNS server as the alternative DNS server.",
      "C": "1. Configure a Cloud DNS private zone in the host project of the Shared VPC.\n2. Set up DNS forwarding to your Google Cloud private zone on your on-premises DNS servers to point to the inbound forwarder IP address in your host project\n3. In your Cloud Router, add a custom route advertisement for the IP 169.254 169 254 to the on-premises environment.",
      "B": "1. Create a Cloud DNS private forwarding zone in the host project of the Shared VPC that forwards the Private zone to the on-premises DNS servers.\n2. In your Cloud Router, add a custom route advertisement for the IP 169.254 169.254 to the on-premises environment.",
      "A": "1. Create a Cloud DNS private forwarding zone in the host project of the Shared VPC that forwards the private zone to the on-premises DNS servers.\n2. In your Cloud Router, add a custom route advertisement for the IP 35.199.192.0/19 to the on-premises environment."
    },
    "id": 47
  },
  {
    "answer": "A",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89774-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your organization is implementing a new security policy to control how firewall rules are applied to control flows between virtual machines (VMs). Using Google-recommended practices, you need to set up a firewall rule to enforce strict control of traffic between VM A and VM B. You must ensure that communications flow only from VM A to VM B within the VPC, and no other communication paths are allowed. No other firewall rules exist in the VPC. Which firewall rule should you configure to allow only this communication path?",
    "choices": {
      "B": "Firewall rule direction: ingress\n\nAction: allow -\n\nTarget: specific VM B tag -\nSource ranges: VM A tag and VM A source IP address\nPriority: 1000",
      "C": "Firewall rule direction: ingress\n\nAction: allow -\n\nTarget: VM A service account -\nSource ranges: VM B service account and VM B source IP address\nPriority: 100",
      "D": "Firewall rule direction: ingress\n\nAction: allow -\n\nTarget: specific VM A tag -\nSource ranges: VM B tag and VM B source IP address\nPriority: 100",
      "A": "Firewall rule direction: ingress\n\nAction: allow -\n\nTarget: VM B service account -\nSource ranges: VM A service account\nPriority: 1000"
    },
    "id": 48
  },
  {
    "answer": "A",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89781-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have configured a service on Google Cloud that connects to an on-premises service via a Dedicated Interconnect. Users are reporting recent connectivity issues. You need to determine whether the traffic is being dropped because of firewall rules or a routing decision. What should you do?",
    "choices": {
      "A": "Use the Network Intelligence Center Connectivity Tests to test the connectivity between the VPC and the on-premises network.",
      "B": "Use Network Intelligence Center Network Topology to check the traffic flow, and replay the traffic from the time period when the connectivity issue occurred.",
      "D": "Configure a Compute Engine instance on the same VPC as the service running on Google Cloud to run a traceroute targeted at the on-premises service.",
      "C": "Configure VPC Flow Logs. Review the logs by filtering on the source and destination."
    },
    "id": 49
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89973-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are configuring a new HTTP application that will be exposed externally behind both IPv4 and IPv6 virtual IP addresses, using ports 80, 8080, and 443. You will have backends in two regions: us-west1 and us-east1. You want to serve the content with the lowest-possible latency while ensuring high availability and autoscaling, and create native content-based rules using the HTTP hostname and request path. The IP addresses of the clients that connect to the load balancer need to be visible to the backends. Which configuration should you use?",
    "choices": {
      "C": "Use External HTTP(S) Load Balancing with URL Maps and custom headers",
      "D": "Use External HTTP(S) Load Balancing with URL Maps and an X-Forwarded-For header",
      "A": "Use Network Load Balancing",
      "B": "Use TCP Proxy Load Balancing with PROXY protocol enabled"
    },
    "id": 50
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89974-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are responsible for designing a new connectivity solution for your organization's enterprise network to access and use Google Workspace. You have an existing Shared VPC with Compute Engine instances in us-west1. Currently, you access Google Workspace via your service provider's internet access. You want to set up a direct connection between your network and Google. What should you do?",
    "choices": {
      "B": "Order a Direct Peering connection in the same metropolitan area. Configure a Border Gateway Protocol (BGP) session between Google and your router.",
      "A": "Order a Dedicated Interconnect connection in the same metropolitan area. Create a VLAN attachment, a Cloud Router in us-west1, and a Border Gateway Protocol (BGP) session between your Cloud Router and your router.",
      "C": "Configure HA VPN in us-west1. Configure a Border Gateway Protocol (BGP) session between your Cloud Router and your on-premises data center.",
      "D": "Order a Carrier Peering connection in the same metropolitan area. Configure a Border Gateway Protocol (BGP) session between Google and your router."
    },
    "id": 51
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89976-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You suspect that one of the virtual machines (VMs) in your default Virtual Private Cloud (VPC) is under a denial-of-service attack. You need to analyze the incoming traffic for the VM to understand where the traffic is coming from. What should you do?",
    "choices": {
      "A": "Enable Data Access audit logs of the VPC. Analyze the logs and get the source IP addresses from the subnetworks.get field.",
      "D": "Enable Data Access audit logs of the subnet. Analyze the logs and get the source IP addresses from the networks.get field.",
      "B": "Enable VPC Flow Logs for the subnet. Analyze the logs and get the source IP addresses from the connection field.",
      "C": "Enable VPC Flow Logs for the VPAnalyze the logs and get the source IP addresses from the src_location field."
    },
    "id": 52
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89978-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are responsible for configuring firewall policies for your company in Google Cloud. Your security team has a strict set of requirements that must be met to configure firewall rules.\n\n• Always allow Secure Shell (SSH) from your corporate IP address.\n• Restrict SSH access from all other IP addresses.\n",
    "choices": {
      "A": "1. Configure a hierarchical firewall policy to the organization node to allow TCP port 22 for your corporate IP address with priority 0.\n2. Configure a hierarchical firewall policy to the organization node to deny TCP port 22 for all IP addresses with priority 1.",
      "C": "1. Configure a VPC firewall rule to allow TCP port 22 for your corporate IP address with priority 1.\n2. Configure a VPC firewall rule to deny TCP port 22 for all IP addresses with priority 0.",
      "B": "1. Configure a VPC firewall rule to allow TCP port 22 for your corporate IP address with priority 0.\n2. Configure a VPC firewall rule to deny TCP port 22 for all IP addresses with priority 1.",
      "D": "1. Configure a hierarchical firewall policy to the organization node to allow TCP port 22 for your corporate IP address with priority 1\n2. Configure a hierarchical firewall policy to the organization node to deny TCP port 22 for all IP addresses with priority 0."
    },
    "id": 53
  },
  {
    "answer": "A",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89977-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing a new application that has backends internally exposed on port 800. The application will be exposed externally using both IPv4 and IPv6 via TCP on port 700. You want to ensure high availability for this application. What should you do?",
    "choices": {
      "D": "Create a TCP proxy that uses backend services containing an instance group with two instances.",
      "B": "Create a network load balancer that uses a target pool backend with two instances.",
      "C": "Create a TCP proxy that uses a zonal network endpoint group containing one instance.",
      "A": "Create a network load balancer that used backend services containing one instance group with two instances."
    },
    "id": 54
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89792-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You work for a university that is migrating to Google Cloud.\n\nThese are the cloud requirements:\n\n• On-premises connectivity with 10 Gbps\n• Lowest latency access to the cloud\n• Centralized Networking Administration Team\n\nNew departments are asking for on-premises connectivity to their projects. You want to deploy the most cost-efficient interconnect solution for connecting the campus to Google Cloud.\n",
    "choices": {
      "D": "Use standalone projects and deploy the VLAN attachments and Dedicated Interconnects in each of the individual projects.",
      "C": "Use standalone projects, and deploy the VLAN attachments in the individual projects. Connect the VLAN attachment to the standalone projects' Dedicated Interconnects.",
      "A": "Use Shared VPC, and deploy the VLAN attachments and Dedicated Interconnect in the host project.",
      "B": "Use Shared VPC, and deploy the VLAN attachments in the service projects. Connect the VLAN attachment to the Shared VPC's host project."
    },
    "id": 55
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/23686-exam-professional-cloud-network-engineer-topic-1-question-15/",
    "question_text": "Your on-premises data center has 2 routers connected to your Google Cloud environment through a VPN on each router. All applications are working correctly; however, all of the traffic is passing across a single VPN instead of being load-balanced across the 2 connections as desired.\nDuring troubleshooting you find:\n\"¢ Each on-premises router is configured with a unique ASN.\n\"¢ Each on-premises router is configured with the same routes and priorities.\n\"¢ Both on-premises routers are configured with a VPN connected to a single Cloud Router.\n\"¢ BGP sessions are established between both on-premises routers and the Cloud Router.\n\"¢ Only 1 of the on-premises router's routes are being added to the routing table.\nWhat is the most likely cause of this problem?",
    "choices": {
      "D": "The ASNs being used on the on-premises routers are different.",
      "A": "The on-premises routers are configured with the same routes.",
      "C": "You do not have a load balancer to load-balance the network traffic.",
      "B": "A firewall is blocking the traffic across the second VPN connection."
    },
    "id": 56
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/89794-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have several microservices running in a private subnet in an existing Virtual Private Cloud (VPC). You need to create additional serverless services that use Cloud Run and Cloud Functions to access the microservices. The network traffic volume between your serverless services and private microservices is low. However, each serverless service must be able to communicate with any of your microservices. You want to implement a solution that minimizes cost. What should you do?",
    "choices": {
      "C": "Deploy your serverless services to the existing VPConfigure firewall rules to allow traffic between the serverless services and your existing microservices.",
      "B": "Create a serverless VPC access connector for each serverless service. Configure the connectors to allow traffic between the serverless services and your existing microservices.",
      "A": "Deploy your serverless services to the serverless VPC. Peer the serverless service VPC to the existing VPC. Configure firewall rules to allow traffic between the serverless services and your existing microservices.",
      "D": "Create a serverless VPC access connector. Configure the serverless service to use the connector for communication to the microservices."
    },
    "id": 57
  },
  {
    "answer": "BC",
    "answer_ET": "CE",
    "url": "https://www.examtopics.com/discussions/google/view/89537-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have provisioned a Dedicated Interconnect connection of 20 Gbps with a VLAN attachment of 10 Gbps. You recently noticed a steady increase in ingress traffic on the Interconnect connection from the on-premises data center. You need to ensure that your end users can achieve the full 20 Gbps throughput as quickly as possible. Which two methods can you use to accomplish this? (Choose two.)",
    "choices": {
      "B": "Configure an additional VLAN attachment of 10 Gbps in the same region. Configure the on-premises router to advertise routes with the same multi-exit discriminator (MED).",
      "D": "From the Google Cloud Console, request a new Dedicated Interconnect connection of 20 Gbps, and configure a VLAN attachment of 10 Gbps.",
      "A": "Configure an additional VLAN attachment of 10 Gbps in another region. Configure the on-premises router to advertise routes with the same multi-exit discriminator (MED).",
      "E": "Configure Link Aggregation Control Protocol (LACP) on the on-premises router to use the 20-Gbps Dedicated Interconnect connection.",
      "C": "From the Google Cloud Console, modify the bandwidth of the VLAN attachment to 20 Gbps."
    },
    "id": 58
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89475-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company has a Virtual Private Cloud (VPC) with two Dedicated Interconnect connections in two different regions: us-west1 and us-east1. Each Dedicated Interconnect connection is attached to a Cloud Router in its respective region by a VLAN attachment. You need to configure a high availability failover path. By default, all ingress traffic from the on-premises environment should flow to the VPC using the us-west1 connection. If us-west1 is unavailable, you want traffic to be rerouted to us-east1. How should you configure the multi-exit discriminator (MED) values to enable this failover path?",
    "choices": {
      "B": "Use global routing. Set the us-east1 Cloud Router to a base priority of 100, and set the us-west1 Cloud Router to a base priority of 1",
      "D": "Use global routing. Set the us-east1 Cloud Router to a base priority of 1000, and set the us-west1 Cloud Router to a base priority of 1",
      "A": "Use regional routing. Set the us-east1 Cloud Router to a base priority of 100, and set the us-west1 Cloud Router to a base priority of 1",
      "C": "Use regional routing. Set the us-east1 Cloud Router to a base priority of 1000, and set the us-west1 Cloud Router to a base priority of 1"
    },
    "id": 59
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89784-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have the following private Google Kubernetes Engine (GKE) cluster deployment:\n\n//IMG//\n\n",
    "choices": {
      "A": "Add the network 192.168.40.0/24 to the masterAuthorizedNetworksConfig. Configure kubectl to communicate with the endpoint 192.168.38.2.",
      "C": "Add the network 192.168.36.0/24 to the masterAuthorizedNetworksConfig. Configure kubectl to communicate with the endpoint 192.168.38.2",
      "D": "Add an external IP address to the VM, and add this IP address in the masterAuthorizedNetworksConfig. Configure kubectl to communicate with the endpoint 35.224.37.17.",
      "B": "Add the network 192.168.38.0/28 to the masterAuthorizedNetworksConfig. Configure kubectl to communicate with the endpoint 192.168.38.2"
    },
    "id": 60
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/128655-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company's logo is published as an image file across multiple websites that are hosted by your company. You have implemented Cloud CDN; however, you want to improve the performance of the cache hit ratio associated with this image file. What should you do?",
    "choices": {
      "C": "Configure versioned URLs for each domain to serve users the image file before the cache entry expires.",
      "A": "Configure custom cache keys for the backend service that holds the image file, and clear the Host and Protocol checkboxes.",
      "D": "Configure Cloud Storage as a custom origin backend to host the image file, and select multi-region as the location type.",
      "B": "Configure the default time to live (TTL) as 0 for the image file."
    },
    "id": 61
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/129976-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company recently migrated to Google Cloud in a single region. You configured separate Virtual Private Cloud (VPC) networks for two departments: Department A and Department B. Department A has requested access to resources that are part of Department B's VPC. You need to configure the traffic from private IP addresses to flow between the VPCs using multi-NIC virtual machines (VMs) to meet security requirements. Your configuration also must:\n\n• Support both TCP and UDP protocols\n• Provide fully automated failover\n• Include health-checks\n• Require minimal manual intervention in the client VMs\n",
    "choices": {
      "C": "Create an instance template and a managed instance group. Configure a single internal load balancer, and define a custom static route with the internal TCP/UDP load balancer as the next hop.",
      "D": "Create an instance template and a managed instance group. Configure two separate internal TCP/UDP load balancers for each protocol (TCP/UDP), and configure the client VMs to use the internal load balancers’ virtual IP addresses.",
      "B": "Create the VMs in different zones, and configure static routes with instance names as next hops.",
      "A": "Create the VMs in the same zone, and configure static routes with IP addresses as next hops."
    },
    "id": 62
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/129177-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing an IP address scheme for new private Google Kubernetes Engine (GKE) clusters. Due to IP address exhaustion of the RFC 1918 address space in your enterprise, you plan to use privately used public IP space for the new clusters. You want to follow Google-recommended practices. What should you do after designing your IP scheme?",
    "choices": {
      "A": "Create the minimum usable RFC 1918 primary and secondary subnet IP ranges for the clusters. Re-use the secondary address range for the pods across multiple private GKE clusters.",
      "D": "Create privately used public IP primary and secondary subnet ranges for the clusters. Create a private GKE cluster with the following options selected: --disable-default-snat, --enable-ip-alias, and --enable-private-nodes.",
      "C": "Create privately used public IP primary and secondary subnet ranges for the clusters. Create a private GKE cluster with the following options selected: --enable-ip-alias and --enable-private-nodes.",
      "B": "Create the minimum usable RFC 1918 primary and secondary subnet IP ranges for the clusters, Re-use the secondary address range for the services across multiple private GKE clusters."
    },
    "id": 63
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/133305-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You want Cloud CDN to serve the https://www.example.com/images/spacetime.png static image file that is hosted in a private Cloud Storage bucket. You are using the USE_ORIGIN_HEADERS cache mode. You receive an HTTP 403 error when opening the file in your browser, and you see that the HTTP response has a Cache-Control: private, max-age=0 header. How should you correct this issue?",
    "choices": {
      "B": "Change the cache mode to Force cache all content.\nC Configure a Cloud Storage bucket permission that gives allUsers the Storage Legacy Object Reader role.",
      "A": "Enable negative caching for the backend bucket.",
      "C": "Increase the default time-to-live (TTL) for the backend service."
    },
    "id": 64
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/128541-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are deploying an application that runs on Compute Engine instances. You need to determine how to expose your application to a new customer. You must ensure that your application meets the following requirements:\n\n• Maps multiple existing reserved external IP addresses to the instance\n• Processes IP Encapsulating Security Payload (ESP) traffic\n",
    "choices": {
      "A": "Configure a target pool, and create protocol forwarding rules for each external IP address.",
      "C": "Configure a target instance, and create a protocol forwarding rule for each external IP address to be mapped to the instance.",
      "D": "Configure the Compute Engine instances’ network interface external IP address from None to Ephemeral. Add as many external IP addresses as required.",
      "B": "Configure a backend service, and create an external network load balancer for each external IP address."
    },
    "id": 65
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/129176-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your product team has web servers running on both us-east1 and us-west1 regions in the prod-servers project. Your security team plans to install an intrusion detection system (IDS) in their own Google Cloud project to inspect the incoming network traffic. What should you do?",
    "choices": {
      "B": "Create a host project and a Sharad VPC for the security team.\nMake prod-servers a service project, and relocate the web servers to shared subnets in both regions.\nEnable IP forwarding on all the web servers.\nCreate the IDS system in a non-shared subnet of us-east1 or us-west1.\nConfigure the web servers to forward the packets to the IDS system.\nC. Create a new project and a VPC for the security team.\nPeer the new VPC with the web servers’ VPC in the prod-servers project.\nEnable IP forwarding on all the web servers.\nInstall the IDS system in both us-east1 and us-west1.\nConfigure the web servers to forward the packets to the IDS system.",
      "A": "Create a new project and a VPC for the security team.\nPeer the new VPC with the web servers’ VPC in the prod-servers project.\nCreate an internal load balancer and the IDS system in both us-east1 and us-west1.\nEnable Packet Mirroring, and create packet mirroring policies inside the new project.",
      "C": "Create a host project and a Shared VPC for the security team.\nMake prod-servers a service project, and relocate the web servers to shared subnets in both regions.\nCreate an internal load balancer and the IDS system in a subnet in either us-east1 or us-west1.\nEnable Packet Mirroring, and create a packet mirroring policy inside the host project."
    },
    "id": 66
  },
  {
    "answer": "BD",
    "answer_ET": "DE",
    "url": "https://www.examtopics.com/discussions/google/view/28863-exam-professional-cloud-network-engineer-topic-1-question-16/",
    "question_text": "You have ordered Dedicated Interconnect in the GCP Console and need to give the Letter of Authorization/Connecting Facility Assignment (LOA-CFA) to your cross-connect provider to complete the physical connection.\nWhich two actions can accomplish this? (Choose two.)",
    "choices": {
      "E": "Contact your cross-connect provider and inform them that Google automatically sent the LOA/CFA to them via email, and to complete the connection.",
      "D": "Check the email for the account of the NOC contact that you specified during the ordering process.",
      "C": "Run gcloud compute interconnects describe <interconnect>.",
      "B": "Download the LOA-CFA from the Hybrid Connectivity section of the GCP Console.",
      "A": "Open a Cloud Support ticket under the Cloud Interconnect category."
    },
    "id": 67
  },
  {
    "answer": "BD",
    "answer_ET": "BC",
    "url": "https://www.examtopics.com/discussions/google/view/128540-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are in the process of deploying an internal HTTP(S) load balancer for your web server virtual machine (VM) instances. What two prerequisite tasks must be completed before creating the load balancer? (Choose two.)",
    "choices": {
      "E": "Determine the subnet mask for Serverless VPC Access.",
      "A": "Choose a region.",
      "B": "Create firewall rules for health checks.",
      "D": "Determine the subnet mask for a proxy-only subnet.",
      "C": "Reserve a static IP address for the load balancer."
    },
    "id": 68
  },
  {
    "answer": "CE",
    "answer_ET": "A E",
    "url": "https://www.examtopics.com/discussions/google/view/133067-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have the networking configuration shown in the diagram. A pair of redundant Dedicated Interconnect connections (int-Iga1 and int-Iga2) terminate on the same Cloud Router. The Interconnect connections terminate on two separate on-premises routers. You are advertising the same prefixes from the Border Gateway Protocol (BGP) sessions associated with the Dedicated Interconnect connections. You need to configure one connection as Active for both ingress and egress traffic. If the active Interconnect connection falls, you want the passive Interconnect connection to automatically begin routing all traffic. Which two actions should you take to meet this requirement? (Choose two.)\n\n//IMG//",
    "choices": {
      "C": "Advertise a lower MED on the active Interconnect connection from the on-premises router.",
      "A": "Configure the advertised route priority as 200 for the BGP session associated with the active interconnect connection.",
      "E": "Configure the advertised route priority as 200 for the BGP session associated with the passive Interconnect connection.",
      "B": "Configure the advertised route priority > 10,200 on the active Interconnect connection.",
      "D": "Advertise a lower MED on the passive Interconnect connection from the on-premises router."
    },
    "id": 69
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/133321-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are a network administrator at your company planning a migration to Google Cloud and you need to finish the migration as quickly as possible. To ease the transition, you decided to use the same architecture as your on-premises network: a hub-and-spoke model. Your on-premises architecture consists of over 50 spokes. Each spoke does not have connectivity to the other spokes, and all traffic is sent through the hub for security reasons. You need to ensure that the Google Cloud architecture matches your on-premises architecture. You want to implement a solution that minimizes management overhead and cost, and uses default networking quotas and limits. What should you do?",
    "choices": {
      "B": "Connect all the spokes to the hub with VPC Network Peering.",
      "A": "Connect all the spokes to the hub with Cloud VPN.",
      "C": "Connect all the spokes to the hub with Cloud VPN. Use a third-party network appliance as a default gateway to prevent connectivity between the spokes.",
      "D": "Connect all the spokes to the hub with VPC Network Peering. Use a third-party network appliance as a default gateway to prevent connectivity between the spokes."
    },
    "id": 70
  },
  {
    "answer": "C",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/133323-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have the networking configuration shown in the diagram. Two VLAN attachments associated with two Dedicated Interconnect connections terminate on the same Cloud Router (mycloudrouter). The Interconnect connections terminate on two separate on-premises routers. You advertise the same prefixes from the Border Gateway Protocol (BGP) sessions associated with each of the VLAN attachments.\n\nYou notice an asymmetric traffic flow between the two Interconnect connections. Which of the following actions should you take to troubleshoot the asymmetric traffic flow?\n\n//IMG//",
    "choices": {
      "C": "From the Google Cloud console, navigate to the Hybrid Connectivity, select the Cloud Router, and view BGP sessions.",
      "B": "From the Cloud CLI, run gcloud compute –-project PROJECT_ID routers get-status mycloudrouter –-region REGION and review the results.",
      "A": "From the Google Cloud console, navigate to Cloud Logging to view VPC Flow Logs and review the results.",
      "D": "From the Cloud CLI, run gcloud compute routers describe mycloudrouter –-region REGION and review the results."
    },
    "id": 71
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/133324-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are responsible for designing a new connectivity solution between your organization's on-premises data center and your Google Cloud Virtual Private Cloud (VPC) network. Currently, there is no end-to-end connectivity. You must ensure a service level agreement (SLA) of 99.99% availability. What should you do?",
    "choices": {
      "C": "Use two Dedicated Interconnect connections in a single metropolitan area. Configure one Cloud Router and enable global routing in the VPC.",
      "B": "Use a Direct Peering connection between your on-premises data center and Google Cloud. Configure Classic VPN with two tunnels and one Cloud Router.",
      "A": "Use one Dedicated Interconnect connection in a single metropolitan area. Configure one Cloud Router and enable global routing in the VPC.",
      "D": "Use HA VPN. Configure one tunnel from each interface of the VPN gateway to connect to the corresponding interfaces on the peer gateway on-premises. Configure one Cloud Router and enable global routing in the VPC."
    },
    "id": 72
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/133066-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company is planning a migration to Google Kubernetes Engine. Your application team informed you that they require a minimum of 60 Pods per node and a maximum of 100 Pods per node. Which Pod per node CIDR range should you use?",
    "choices": {
      "D": "/28",
      "C": "/26",
      "A": "/24",
      "B": "/25"
    },
    "id": 73
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/133396-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing a packet mirroring policy as part of your network security architecture for your gaming workload. Your infrastructure is located in the us-west2 region and deployed across several zones: us-west2-a, us-west2-b, and us-west2-c. The infrastructure is running a web-based application on TCP ports 80 and 443 with other game servers that utilize the UDP protocol. You need to deploy packet mirroring policies and collector instances to monitor web application traffic while minimizing inter-zonal network egress costs.\n",
    "choices": {
      "D": "Create three packet mirroring policies: one for each zone. Create three groups of collector instances: one group for each zone. Configure each policy to match traffic for its zone based on subnets, and create a filter for TCP traffic.",
      "A": "Crate three packet mirroring policies: one for each zone. Create one group of collector instances for the us-west2 region. Configure each packet mirroring policy to match traffic for its zone based on instance-tags, and create a filter for TCP traffic.",
      "B": "Create one packet mirroring policy for the us-west2 region. Create one group of collector instances for the us-west2 region. Configure the packet mirroring policy to match traffic for web server instances based on instance-tags, and create a filter for TCP traffic.",
      "C": "Create three packet mirroring policies: one for each zone. Create three groups of collector instances: one group for each zone. Configure each policy to match traffic for its zone based on instance-tags, and create a filter for TCP traffic."
    },
    "id": 74
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/133397-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "Your company recently migrated to Google Cloud. You configured separate Virtual Private Cloud (VPC) networks for Department A and Department B. You need to configure both VPC networks to have access to the same on-premises location through separate links with full isolation between the VPC networks. Your design must also query on-premises DNS servers from workloads in Google Cloud using conditional forwarding. You want to minimize operational overhead. What should you do?",
    "choices": {
      "C": "Peer Department A's and Department B's VPC networks to have all on-premises connectivity via a single VPC network. Use separate Cloud DNS private zones and Cloud DNS forwarding zones.",
      "A": "Customize the operating system DNS configuration files to target the on-premises DNS servers.",
      "D": "Configure a Cloud DNS Peering zone in Department A's VPC network pointing to Department B's VPC and a Cloud DNS outbound forwarding zone in Department B's VPC network. Use separate on-premises links in each VPC network.",
      "B": "Keep the different VPC networks from both departments isolated with different on-premises links, and separate Cloud DNS private zones and Cloud DNS forwarding zones."
    },
    "id": 75
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/133371-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are planning to use Terraform to deploy the Google Cloud infrastructure for your company. The design must meet the following requirements:\n\n• Each Google Cloud project must represent an internal project that your team will work on.\n• After an internal project is finished, the infrastructure must be deleted.\n• Each internal project must have its own Google Cloud project owner to manage the Google Cloud resources.\n• You have 10-100 projects deployed at a time.\n\nWhile you are writing the Terraform code, you need to ensure that the deployment is simple and the code is reusable with centralized management.",
    "choices": {
      "C": "Create a single project and additional VPCs for each internal project.\nD.O Create a Shared VPC and service project for each internal project.",
      "B": "Create a single Shared VPC and attach each Google Cloud project as a service project.",
      "A": "Create a single project and single VPC for each internal project."
    },
    "id": 76
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/133372-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have the following Shared VPC design. VPC Flow Logs is configured for Subnet-1 in the host VPC. You also want to monitor flow logs for Subnet-2. What should you do?\n\n//IMG//",
    "choices": {
      "B": "Configure VPC Flow Logs in the service project VPC for Subnet-2.",
      "D": "Configure a firewall rule to permit Subnet-2 IP addresses outbound in the host project VPC.",
      "A": "Configure a VPC Flow Logs filter for Subnet-2 in the host project VPC.",
      "C": "Configure Packet Mirroring in both the host and service project VPCs."
    },
    "id": 77
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/22898-exam-professional-cloud-network-engineer-topic-1-question-17/",
    "question_text": "Your company offers a popular gaming service. Your instances are deployed with private IP addresses, and external access is granted through a global load balancer. You believe you have identified a potential malicious actor, but aren't certain you have the correct client IP address. You want to identify this actor while minimizing disruption to your legitimate users.\nWhat should you do?",
    "choices": {
      "A": "Create a Cloud Armor Policy rule that denies traffic and review necessary logs.",
      "D": "Create a VPC Firewall rule that denies traffic, enable logging and set enforcement to enabled, and review necessary logs.",
      "B": "Create a Cloud Armor Policy rule that denies traffic, enable preview mode, and review necessary logs.",
      "C": "Create a VPC Firewall rule that denies traffic, enable logging and set enforcement to disabled, and review necessary logs."
    },
    "id": 78
  },
  {
    "answer": "AC",
    "answer_ET": "CD",
    "url": "https://www.examtopics.com/discussions/google/view/133393-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are configuring your organization's Google Cloud environment to connect to your on-premises network, which does not support Border Gateway Protocol (BGP). Your on-premises network has 30 CIDR ranges that must be reachable from Google Cloud. Your VPN gateway creates a unique child security association (SA) per CIDR. You must ensure that the 30 CIDR ranges in your on-premises network are reachable from Google Cloud.\n",
    "choices": {
      "A": "Create a single Cloud VPN tunnel that uses route-based VPN.",
      "D": "Create multiple Cloud VPN tunnels that use policy-based routing with 10 CIDR per tunnel as the remote traffic selectors.",
      "B": "Create a single Cloud VPN tunnel that uses policy-based routing with 30 CIDRs as the remote traffic selectors.",
      "C": "Create multiple Cloud VPN tunnels that use policy-based routing so that each tunnel has one CIDR block for its local traffic selector and one CIDR block for its remote traffic selector. Connect each tunnel to unique peer IP addresses.",
      "E": "Create multiple Cloud VPN tunnels that use policy-based routing so that each tunnel has one CIDR block for its local traffic selector and one CIDR block for its remote traffic selector. Connect each tunnel to the same peer IP address."
    },
    "id": 79
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/133378-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You have two VPCs: VPC A in Project A and VPC B in Project B. The VPCs are peered, and each VPC has VM instances in four zones. You are using the Network Intelligence Center Performance Dashboard to investigate the packet loss for traffic flows that start in VPC A and terminate in VPC B. You need the reported packet loss metric to have at least a 90% confidence level. What should you do?",
    "choices": {
      "C": "Ensure that each zone in each of the VPC networks has at least 9 compute instances. Look in Project A for the reported metric.",
      "A": "Ensure that each zone in each of the VPC networks has at least 10 compute instances. Look in Project A for the reported metric.",
      "B": "Ensure that each zone in each of the VPC networks has at least 9 compute instances. Look in Project B for the reported metric.",
      "D": "Ensure that each zone in each of the VPC networks has at least 10 compute instances. Look in Project B for the reported metric."
    },
    "id": 80
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/133395-exam-professional-cloud-network-engineer-topic-1-question/",
    "question_text": "You are designing a new network infrastructure for your customer in Google Cloud. Your customer requires a connection between two Google Cloud VPCs that must include a VPN tunnel. You want to follow Google-recommended practices while ensuring maximum availability of the connection. Which VPN configuration should you choose?",
    "choices": {
      "D": "Border Gateway Protocol (BGP)-based VPN using HA VPN between the two Google Cloud VPCs",
      "B": "Border Gateway Protocol (BGP)-based VPN using Classic VPN between the two Google Cloud VPCs",
      "C": "Route-based VPN using Classic VPN between the two Google Cloud VPCs",
      "A": "Policy-based VPN using Classic VPN between the two Google Cloud VPCs"
    },
    "id": 81
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/29375-exam-professional-cloud-network-engineer-topic-1-question-18/",
    "question_text": "Your company's web server administrator is migrating on-premises backend servers for an application to GCP. Libraries and configurations differ significantly across these backend servers. The migration to GCP will be lift-and-shift, and all requests to the servers will be served by a single network load balancer frontend.\nYou want to use a GCP-native solution when possible.\nHow should you deploy this service in GCP?",
    "choices": {
      "A": "Create a managed instance group from one of the images of the on-premises servers, and link this instance group to a target pool behind your load balancer.",
      "D": "Use GCP's ECMP capability to load-balance traffic to the backend servers by installing multiple equal-priority static routes to the backend servers.",
      "B": "Create a target pool, add all backend instances to this target pool, and deploy the target pool behind your load balancer.",
      "C": "Deploy a third-party virtual appliance as frontend to these servers that will accommodate the significant differences between these backend servers."
    },
    "id": 82
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/28846-exam-professional-cloud-network-engineer-topic-1-question-19/",
    "question_text": "You decide to set up Cloud NAT. After completing the configuration, you find that one of your instances is not using the Cloud NAT for outbound NAT.\nWhat is the most likely cause of this problem?",
    "choices": {
      "A": "The instance has been configured with multiple interfaces.",
      "B": "An external IP address has been configured on the instance.",
      "D": "The instance is accessible by a load balancer external IP address.",
      "C": "You have created static routes that use RFC1918 ranges."
    },
    "id": 83
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/16469-exam-professional-cloud-network-engineer-topic-1-question-2/",
    "question_text": "Your end users are located in close proximity to us-east1 and europe-west1. Their workloads need to communicate with each other. You want to minimize cost and increase network efficiency.\nHow should you design this topology?",
    "choices": {
      "B": "Create 2 VPCs, each with their own region and individual subnets. Use external IP addresses on the instances to establish connectivity between these regions.",
      "D": "Create 1 VPC with 2 regional subnets. Deploy workloads in these subnets and have them communicate using private RFC1918 IP addresses.",
      "A": "Create 2 VPCs, each with their own regions and individual subnets. Create 2 VPN gateways to establish connectivity between these regions.",
      "C": "Create 1 VPC with 2 regional subnets. Create a global load balancer to establish connectivity between the regions."
    },
    "id": 84
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/29378-exam-professional-cloud-network-engineer-topic-1-question-20/",
    "question_text": "You want to set up two Cloud Routers so that one has an active Border Gateway Protocol (BGP) session, and the other one acts as a standby.\nWhich BGP attribute should you use on your on-premises router?",
    "choices": {
      "A": "AS-Path",
      "D": "Multi-exit Discriminator",
      "B": "Community",
      "C": "Local Preference"
    },
    "id": 85
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/24513-exam-professional-cloud-network-engineer-topic-1-question-21/",
    "question_text": "You are increasing your usage of Cloud VPN between on-premises and GCP, and you want to support more traffic than a single tunnel can handle. You want to increase the available bandwidth using Cloud VPN.\nWhat should you do?",
    "choices": {
      "B": "Create two VPN tunnels on the same Cloud VPN gateway that point to the same destination VPN gateway IP address.",
      "D": "Add a second Cloud VPN gateway in a different region than the existing VPN gateway. Create a new tunnel on the second Cloud VPN gateway that forwards the same IP range, but points to the existing on-premises VPN gateway IP address.",
      "A": "Double the MTU on your on-premises VPN gateway from 1460 bytes to 2920 bytes.",
      "C": "Add a second on-premises VPN gateway with a different public IP address. Create a second tunnel on the existing Cloud VPN gateway that forwards the same IP range, but points at the new on-premises gateway IP."
    },
    "id": 86
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/29472-exam-professional-cloud-network-engineer-topic-1-question-22/",
    "question_text": "You are disabling DNSSEC for one of your Cloud DNS-managed zones. You removed the DS records from your zone file, waited for them to expire from the cache, and disabled DNSSEC for the zone. You receive reports that DNSSEC validating resolves are unable to resolve names in your zone.\nWhat should you do?",
    "choices": {
      "A": "Update the TTL for the zone.",
      "B": "Set the zone to the TRANSFER state.",
      "C": "Disable DNSSEC at your domain registrar.",
      "D": "Transfer ownership of the domain to a new registrar."
    },
    "id": 87
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/30859-exam-professional-cloud-network-engineer-topic-1-question-23/",
    "question_text": "You have an application hosted on a Compute Engine virtual machine instance that cannot communicate with a resource outside of its subnet. When you review the flow and firewall logs, you do not see any denied traffic listed.\nDuring troubleshooting you find:\n\"¢ Flow logs are enabled for the VPC subnet, and all firewall rules are set to log.\n\"¢ The subnetwork logs are not excluded from Stackdriver.\n\"¢ The instance that is hosting the application can communicate outside the subnet.\n\"¢ Other instances within the subnet can communicate outside the subnet.\n\"¢ The external resource initiates communication.\nWhat is the most likely cause of the missing log lines?",
    "choices": {
      "B": "The traffic is matching the expected egress rule.",
      "C": "The traffic is not matching the expected ingress rule.",
      "A": "The traffic is matching the expected ingress rule.",
      "D": "The traffic is not matching the expected egress rule."
    },
    "id": 88
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/29477-exam-professional-cloud-network-engineer-topic-1-question-24/",
    "question_text": "You have configured Cloud CDN using HTTP(S) load balancing as the origin for cacheable content. Compression is configured on the web servers, but responses served by Cloud CDN are not compressed.\nWhat is the most likely cause of the problem?",
    "choices": {
      "B": "You have configured the web servers and Cloud CDN with different compression types.",
      "A": "You have not configured compression in Cloud CDN.",
      "D": "You have to configure the web servers to compress responses even if the request has a Via header.",
      "C": "The web servers behind the load balancer are configured with different compression types."
    },
    "id": 89
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/29478-exam-professional-cloud-network-engineer-topic-1-question-25/",
    "question_text": "You have a web application that is currently hosted in the us-central1 region. Users experience high latency when traveling in Asia. You've configured a network load balancer, but users have not experienced a performance improvement. You want to decrease the latency.\nWhat should you do?",
    "choices": {
      "C": "Configure Dynamic Routing for the subnet hosting the application.",
      "A": "Configure a policy-based route rule to prioritize the traffic.",
      "D": "Configure the TTL for the DNS zone to decrease the time between updates.",
      "B": "Configure an HTTP load balancer, and direct the traffic to it."
    },
    "id": 90
  },
  {
    "answer": "AE",
    "answer_ET": "BE",
    "url": "https://www.examtopics.com/discussions/google/view/35714-exam-professional-cloud-network-engineer-topic-1-question-26/",
    "question_text": "You have an application running on Compute Engine that uses BigQuery to generate some results that are stored in Cloud Storage. You want to ensure that none of the application instances have external IP addresses.\nWhich two methods can you use to accomplish this? (Choose two.)",
    "choices": {
      "D": "Create network peering between your VPC and BigQuery.",
      "B": "Enable Private Google Access on the VPC.",
      "E": "Create a Cloud NAT, and route the application traffic via NAT gateway.",
      "C": "Enable Private Services Access on the VPC.",
      "A": "Enable Private Google Access on all the subnets."
    },
    "id": 91
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/35716-exam-professional-cloud-network-engineer-topic-1-question-27/",
    "question_text": "You are designing a shared VPC architecture. Your network and security team has strict controls over which routes are exposed between departments. Your\nProduction and Staging departments can communicate with each other, but only via specific networks. You want to follow Google-recommended practices.\nHow should you design this topology?",
    "choices": {
      "A": "Create 2 shared VPCs within the shared VPC Host Project, and enable VPC peering between them. Use firewall rules to filter access between the specific networks.",
      "C": "Create 2 shared VPCs within the shared VPC Service Project, and create a Cloud VPN/Cloud Router between them. Use Flexible Route Advertisement (FRA) to filter access between the specific networks.",
      "D": "Create 1 VPC within the shared VPC Host Project, and share individual subnets with the Service Projects to filter access between the specific networks.",
      "B": "Create 2 shared VPCs within the shared VPC Host Project, and create a Cloud VPN/Cloud Router between them. Use Flexible Route Advertisement (FRA) to filter access between the specific networks."
    },
    "id": 92
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/16386-exam-professional-cloud-network-engineer-topic-1-question-28/",
    "question_text": "You are adding steps to a working automation that uses a service account to authenticate. You need to drive the automation the ability to retrieve files from a\nCloud Storage bucket. Your organization requires using the least privilege possible.\nWhat should you do?",
    "choices": {
      "C": "Grant the read-only privilege to the service account for the Cloud Storage bucket.",
      "D": "Grant the cloud-platform privilege to the service account for the Cloud Storage bucket.",
      "B": "Grant the iam.serviceAccountUser to your user account.",
      "A": "Grant the compute.instanceAdmin to your user account."
    },
    "id": 93
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/35718-exam-professional-cloud-network-engineer-topic-1-question-29/",
    "question_text": "You converted an auto mode VPC network to custom mode. Since the conversion, some of your Cloud Deployment Manager templates are no longer working.\nYou want to resolve the problem.\nWhat should you do?",
    "choices": {
      "C": "Explicitly reference the custom mode networks in the Cloud Armor whitelist.",
      "A": "Apply an additional IAM role to the Google API's service account to allow custom mode networks.",
      "D": "Explicitly reference the custom mode networks in the Deployment Manager templates.",
      "B": "Update the VPC firewall to allow the Cloud Deployment Manager to access the custom mode networks."
    },
    "id": 94
  },
  {
    "answer": "C",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/21662-exam-professional-cloud-network-engineer-topic-1-question-3/",
    "question_text": "Your organization is deploying a single project for 3 separate departments. Two of these departments require network connectivity between each other, but the third department should remain in isolation. Your design should create separate network administrative domains between these departments. You want to minimize operational overhead.\nHow should you design the topology?",
    "choices": {
      "C": "Create 3 separate VPCs, and use VPC peering to establish connectivity between the two appropriate VPCs.",
      "D": "Create a single project, and deploy specific firewall rules. Use network tags to isolate access between the departments.",
      "A": "Create a Shared VPC Host Project and the respective Service Projects for each of the 3 separate departments.",
      "B": "Create 3 separate VPCs, and use Cloud VPN to establish connectivity between the two appropriate VPCs."
    },
    "id": 95
  },
  {
    "answer": "BD",
    "answer_ET": "DE",
    "url": "https://www.examtopics.com/discussions/google/view/35719-exam-professional-cloud-network-engineer-topic-1-question-30/",
    "question_text": "You have recently been put in charge of managing identity and access management for your organization. You have several projects and want to use scripting and automation wherever possible. You want to grant the editor role to a project member.\nWhich two methods can you use to accomplish this? (Choose two.)",
    "choices": {
      "B": "setIamPolicy() via REST API",
      "D": "gcloud projects add-iam-policy-binding Sprojectname --member user:Susername --role roles/editor",
      "E": "Enter an email address in the Add members field, and select the desired role from the drop-down menu in the GCP Console.",
      "C": "gcloud pubsub add-iam-policy-binding Sprojectname --member user:Susername --role roles/editor",
      "A": "GetIamPolicy() via REST API"
    },
    "id": 96
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/35720-exam-professional-cloud-network-engineer-topic-1-question-31/",
    "question_text": "You are using a 10-Gbps direct peering connection to Google together with the gsutil tool to upload files to Cloud Storage buckets from on-premises servers. The on-premises servers are 100 milliseconds away from the Google peering point. You notice that your uploads are not using the full 10-Gbps bandwidth available to you. You want to optimize the bandwidth utilization of the connection.\nWhat should you do on your on-premises servers?",
    "choices": {
      "A": "Tune TCP parameters on the on-premises servers.",
      "C": "Remove the -m flag from the gsutil command to enable single-threaded transfers.",
      "B": "Compress files using utilities like tar to reduce the size of data being sent.",
      "D": "Use the perfdiag parameter in your gsutil command to enable faster performance: gsutil perfdiag gs://[BUCKET NAME]."
    },
    "id": 97
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/35721-exam-professional-cloud-network-engineer-topic-1-question-32/",
    "question_text": "You work for a multinational enterprise that is moving to GCP.\nThese are the cloud requirements:\n\"¢ An on-premises data center located in the United States in Oregon and New York with Dedicated Interconnects connected to Cloud regions us-west1 (primary\nHQ) and us-east4 (backup)\n\"¢ Multiple regional offices in Europe and APAC\n\"¢ Regional data processing is required in europe-west1 and australia-southeast1\n\"¢ Centralized Network Administration Team\nYour security and compliance team requires a virtual inline security appliance to perform L7 inspection for URL filtering. You want to deploy the appliance in us- west1.\nWhat should you do?",
    "choices": {
      "B": "\"¢ Create 2 VPCs in a Shared VPC Host Project. \"¢ Configure a 2-NIC instance in zone us-west1-a in the Service Project. \"¢ Attach NIC0 in VPC #1 us-west1 subnet of the Host Project. \"¢ Attach NIC1 in VPC #2 us-west1 subnet of the Host Project. \"¢ Deploy the instance. \"¢ Configure the necessary routes and firewall rules to pass traffic through the instance.",
      "D": "\"¢ Create 1 VPC in a Shared VPC Service Project. \"¢ Configure a 2-NIC instance in zone us-west1-a in the Service Project. \"¢ Attach NIC0 in us-west1 subnet of the Service Project. \"¢ Attach NIC1 in us-west1 subnet of the Service Project \"¢ Deploy the instance. \"¢ Configure the necessary routes and firewall rules to pass traffic through the instance.",
      "C": "\"¢ Create 1 VPC in a Shared VPC Host Project. \"¢ Configure a 2-NIC instance in zone us-west1-a in the Host Project. \"¢ Attach NIC0 in us-west1 subnet of the Host Project. \"¢ Attach NIC1 in us-west1 subnet of the Host Project \"¢ Deploy the instance. \"¢ Configure the necessary routes and firewall rules to pass traffic through the instance.",
      "A": "\"¢ Create 2 VPCs in a Shared VPC Host Project. \"¢ Configure a 2-NIC instance in zone us-west1-a in the Host Project. \"¢ Attach NIC0 in VPC #1 us-west1 subnet of the Host Project. \"¢ Attach NIC1 in VPC #2 us-west1 subnet of the Host Project. \"¢ Deploy the instance. \"¢ Configure the necessary routes and firewall rules to pass traffic through the instance."
    },
    "id": 98
  },
  {
    "answer": "A",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/35722-exam-professional-cloud-network-engineer-topic-1-question-33/",
    "question_text": "You are designing a Google Kubernetes Engine (GKE) cluster for your organization. The current cluster size is expected to host 10 nodes, with 20 Pods per node and 150 services. Because of the migration of new services over the next 2 years, there is a planned growth for 100 nodes, 200 Pods per node, and 1500 services. You want to use VPC-native clusters with alias IP ranges, while minimizing address consumption.\nHow should you design this topology?",
    "choices": {
      "D": "Use gcloud container clusters create [CLUSTER NAME] to create a VPC-native cluster.",
      "A": "Create a subnet of size/25 with 2 secondary ranges of: /17 for Pods and /21 for Services. Create a VPC-native cluster and specify those ranges.",
      "B": "Create a subnet of size/28 with 2 secondary ranges of: /24 for Pods and /24 for Services. Create a VPC-native cluster and specify those ranges. When the services are ready to be deployed, resize the subnets.",
      "C": "Use gcloud container clusters create [CLUSTER NAME]--enable-ip-alias to create a VPC-native cluster."
    },
    "id": 99
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/25449-exam-professional-cloud-network-engineer-topic-1-question-34/",
    "question_text": "Your company has recently expanded their EMEA-based operations into APAC. Globally distributed users report that their SMTP and IMAP services are slow.\nYour company requires end-to-end encryption, but you do not have access to the SSL certificates.\nWhich Google Cloud load balancer should you use?",
    "choices": {
      "C": "HTTPS load balancer",
      "A": "SSL proxy load balancer",
      "D": "TCP proxy load balancer",
      "B": "Network load balancer"
    },
    "id": 100
  },
  {
    "answer": "AC",
    "answer_ET": "CD",
    "url": "https://www.examtopics.com/discussions/google/view/35723-exam-professional-cloud-network-engineer-topic-1-question-35/",
    "question_text": "Your company is working with a partner to provide a solution for a customer. Both your company and the partner organization are using GCP. There are applications in the partner's network that need access to some resources in your company's VPC. There is no CIDR overlap between the VPCs.\nWhich two solutions can you implement to achieve the desired results without compromising the security? (Choose two.)",
    "choices": {
      "B": "Shared VPC",
      "D": "Dedicated Interconnect",
      "C": "Cloud VPN",
      "A": "VPC peering",
      "E": "Cloud NAT"
    },
    "id": 101
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/35724-exam-professional-cloud-network-engineer-topic-1-question-36/",
    "question_text": "You have a storage bucket that contains the following objects:\n[1]\n[1]\n[1]\n[1]\nCloud CDN is enabled on the storage bucket, and all four objects have been successfully cached. You want to remove the cached copies of all the objects with the prefix folder-a, using the minimum number of commands.\nWhat should you do?",
    "choices": {
      "D": "Disable Cloud CDN on the storage bucket. Wait 90 seconds. Re-enable Cloud CDN on the storage bucket.",
      "C": "Make sure that all the objects with prefix folder-a are not shared publicly.",
      "B": "Issue a cache invalidation command with pattern /folder-a/*.",
      "A": "Add an appropriate lifecycle rule on the storage bucket."
    },
    "id": 102
  },
  {
    "answer": "AB",
    "answer_ET": "CD",
    "url": "https://www.examtopics.com/discussions/google/view/35725-exam-professional-cloud-network-engineer-topic-1-question-37/",
    "question_text": "Your company is running out of network capacity to run a critical application in the on-premises data center. You want to migrate the application to GCP. You also want to ensure that the Security team does not lose their ability to monitor traffic to and from Compute Engine instances.\nWhich two products should you incorporate into the solution? (Choose two.)",
    "choices": {
      "B": "Firewall logs",
      "A": "VPC flow logs",
      "C": "Cloud Audit logs",
      "D": "Stackdriver Trace",
      "E": "Compute Engine instance system logs"
    },
    "id": 103
  },
  {
    "answer": "D",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/35709-exam-professional-cloud-network-engineer-topic-1-question-38/",
    "question_text": "You want to apply a new Cloud Armor policy to an application that is deployed in Google Kubernetes Engine (GKE). You want to find out which target to use for your Cloud Armor policy.\nWhich GKE resource should you use?",
    "choices": {
      "A": "GKE Node",
      "D": "GKE Ingress",
      "C": "GKE Cluster",
      "B": "GKE Pod"
    },
    "id": 104
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/35428-exam-professional-cloud-network-engineer-topic-1-question-39/",
    "question_text": "You need to establish network connectivity between three Virtual Private Cloud networks, Sales, Marketing, and Finance, so that users can access resources in all three VPCs. You configure VPC peering between the Sales VPC and the Finance VPC. You also configure VPC peering between the Marketing VPC and the\nFinance VPC. After you complete the configuration, some users cannot connect to resources in the Sales VPC and the Marketing VPC. You want to resolve the problem.\nWhat should you do?",
    "choices": {
      "B": "Alter the routing table to resolve the asymmetric route.",
      "C": "Create network tags to allow connectivity between all three VPCs.",
      "D": "Delete the legacy network and recreate it to allow transitive peering.",
      "A": "Configure VPC peering in a full mesh."
    },
    "id": 105
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/29126-exam-professional-cloud-network-engineer-topic-1-question-4/",
    "question_text": "You are migrating to Cloud DNS and want to import your BIND zone file.\nWhich command should you use?",
    "choices": {
      "C": "gcloud dns record-sets import ZONE_FILE --zone-file-format --zone MANAGED_ZONE",
      "D": "gcloud dns record-sets import ZONE_FILE --delete-all-existing --zone MANAGED ZONE",
      "A": "gcloud dns record-sets import ZONE_FILE --zone MANAGED_ZONE",
      "B": "gcloud dns record-sets import ZONE_FILE --replace-origin-ns --zone MANAGED_ZONE"
    },
    "id": 106
  },
  {
    "answer": "D",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/35731-exam-professional-cloud-network-engineer-topic-1-question-40/",
    "question_text": "You create multiple Compute Engine virtual machine instances to be used at TFTP servers.\nWhich type of load balancer should you use?",
    "choices": {
      "B": "SSL proxy load balancer",
      "D": "Network load balancer",
      "A": "HTTP(S) load balancer",
      "C": "TCP proxy load balancer"
    },
    "id": 107
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/16402-exam-professional-cloud-network-engineer-topic-1-question-41/",
    "question_text": "You want to configure load balancing for an internet-facing, standard voice-over-IP (VOIP) application.\nWhich type of load balancer should you use?",
    "choices": {
      "B": "Network load balancer",
      "A": "HTTP(S) load balancer",
      "C": "Internal TCP/UDP load balancer",
      "D": "TCP/SSL proxy load balancer"
    },
    "id": 108
  },
  {
    "answer": "B",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/32794-exam-professional-cloud-network-engineer-topic-1-question-42/",
    "question_text": "You want to configure a NAT to perform address translation between your on-premises network blocks and GCP.\nWhich NAT solution should you use?",
    "choices": {
      "B": "An instance with IP forwarding enabled",
      "A": "Cloud NAT",
      "D": "An instance configured with iptables SNAT rules",
      "C": "An instance configured with iptables DNAT rules"
    },
    "id": 109
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/35402-exam-professional-cloud-network-engineer-topic-1-question-43/",
    "question_text": "You need to ensure your personal SSH key works on every instance in your project. You want to accomplish this as efficiently as possible.\nWhat should you do?",
    "choices": {
      "B": "Upload your public ssh key to each instance Metadata.",
      "A": "Upload your public ssh key to the project Metadata.",
      "C": "Create a custom Google Compute Engine image with your public ssh key embedded.",
      "D": "Use gcloud compute ssh to automatically copy your public ssh key to the instance."
    },
    "id": 110
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/16403-exam-professional-cloud-network-engineer-topic-1-question-44/",
    "question_text": "In order to provide subnet level isolation, you want to force instance-A in one subnet to route through a security appliance, called instance-B, in another subnet.\nWhat should you do?",
    "choices": {
      "C": "Delete the system-generated subnet route and create a specific route to instance-B with a tag applied to instance-A.",
      "B": "Create a more specific route than the system-generated subnet route, pointing the next hop to instance-B with a tag applied to instance-A.",
      "D": "Move instance-B to another VPC and, using multi-NIC, connect instance-B's interface to instance-A's network. Configure the appropriate routes to force traffic through to instance-A.",
      "A": "Create a more specific route than the system-generated subnet route, pointing the next hop to instance-B with no tag."
    },
    "id": 111
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/24580-exam-professional-cloud-network-engineer-topic-1-question-45/",
    "question_text": "You create a Google Kubernetes Engine private cluster and want to use kubectl to get the status of the pods. In one of your instances you notice the master is not responding, even though the cluster is up and running.\nWhat should you do to solve the problem?",
    "choices": {
      "C": "Create the appropriate firewall policy in the VPC to allow traffic from Master node IP address to the instance.",
      "B": "Create a route to reach the Master, pointing to the default internet gateway.",
      "D": "Create the appropriate master authorized network entries to allow the instance to communicate to the master.",
      "A": "Assign a public IP address to the instance."
    },
    "id": 112
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/23729-exam-professional-cloud-network-engineer-topic-1-question-46/",
    "question_text": "Your company has a security team that manages firewalls and SSL certificates. It also has a networking team that manages the networking resources. The networking team needs to be able to read firewall rules, but should not be able to create, modify, or delete them.\nHow should you set up permissions for the networking team?",
    "choices": {
      "C": "Assign members of the networking team a custom role with only the compute.networks.* and the compute.firewalls.list permissions.",
      "A": "Assign members of the networking team the compute.networkUser role.",
      "D": "Assign members of the networking team the compute.networkViewer role, and add the compute.networks.use permission.",
      "B": "Assign members of the networking team the compute.networkAdmin role."
    },
    "id": 113
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/24591-exam-professional-cloud-network-engineer-topic-1-question-47/",
    "question_text": "You have created an HTTP(S) load balanced service. You need to verify that your backend instances are responding properly.\nHow should you configure the health check?",
    "choices": {
      "D": "Set proxy-header to the default value, and set host to include a custom host header that identifies the health check.",
      "B": "Set request-path to a specific URL used for health checking, and set host to include a custom host header that identifies the health check.",
      "A": "Set request-path to a specific URL used for health checking, and set proxy-header to PROXY_V1.",
      "C": "Set request-path to a specific URL used for health checking, and set response to a string that the backend service will always return in the response body."
    },
    "id": 114
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/16422-exam-professional-cloud-network-engineer-topic-1-question-48/",
    "question_text": "You need to give each member of your network operations team least-privilege access to create, modify, and delete Cloud Interconnect VLAN attachments.\nWhat should you do?",
    "choices": {
      "B": "Assign each user the compute.networkAdmin role.",
      "A": "Assign each user the editor role.",
      "C": "Give each user the following permissions only: compute.interconnectAttachments.create, compute.interconnectAttachments.get.",
      "D": "Give each user the following permissions only: compute.interconnectAttachments.create, compute.interconnectAttachments.get, compute.routers.create, compute.routers.get, compute.routers.update."
    },
    "id": 115
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/16423-exam-professional-cloud-network-engineer-topic-1-question-49/",
    "question_text": "You have an application that is running in a managed instance group. Your development team has released an updated instance template which contains a new feature which was not heavily tested. You want to minimize impact to users if there is a bug in the new template.\nHow should you update your instances?",
    "choices": {
      "B": "Using the new instance template, perform a rolling update across all instances in the instance group. Verify the new feature once the rollout completes.",
      "C": "Deploy a new instance group and canary the updated template in that group. Verify the new feature in the new canary instance group, and then update the original instance group.",
      "D": "Perform a canary update by starting a rolling update and specifying a target size for your instances to receive the new template. Verify the new feature on the canary instances, and then roll forward to the rest of the instances.",
      "A": "Manually patch some of the instances, and then perform a rolling restart on the instance group."
    },
    "id": 116
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/22944-exam-professional-cloud-network-engineer-topic-1-question-5/",
    "question_text": "You created a VPC network named Retail in auto mode. You want to create a VPC network named Distribution and peer it with the Retail VPC.\nHow should you configure the Distribution VPC?",
    "choices": {
      "D": "Rename the default VPC as \"Distribution\" and peer it via network peering.",
      "B": "Create the Distribution VPC in custom mode. Use the CIDR range 10.0.0.0/9. Create the necessary subnets, and then peer them via network peering.",
      "C": "Create the Distribution VPC in custom mode. Use the CIDR range 10.128.0.0/9. Create the necessary subnets, and then peer them via network peering.",
      "A": "Create the Distribution VPC in auto mode. Peer both the VPCs via network peering."
    },
    "id": 117
  },
  {
    "answer": "A",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/16424-exam-professional-cloud-network-engineer-topic-1-question-50/",
    "question_text": "You have deployed a proof-of-concept application by manually placing instances in a single Compute Engine zone. You are now moving the application to production, so you need to increase your application availability and ensure it can autoscale.\nHow should you provision your instances?",
    "choices": {
      "C": "Create an unmanaged instance group in a single zone, and then create an HTTP load balancer for the instance group.",
      "A": "Create a single managed instance group, specify the desired region, and select Multiple zones for the location.",
      "D": "Create an unmanaged instance group for each zone, and manually distribute the instances across the desired zones.",
      "B": "Create a managed instance group for each region, select Single zone for the location, and manually distribute instances across the zones in that region."
    },
    "id": 118
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/36697-exam-professional-cloud-network-engineer-topic-1-question-51/",
    "question_text": "You have a storage bucket that contains two objects. Cloud CDN is enabled on the bucket, and both objects have been successfully cached. Now you want to make sure that one of the two objects will not be cached anymore, and will always be served to the internet directly from the origin.\nWhat should you do?",
    "choices": {
      "A": "Ensure that the object you don't want to be cached anymore is not shared publicly.",
      "D": "Add a Cache-Control entry with value private to the metadata of the object you don't want to be cached anymore. Invalidate all the previously cached copies.",
      "B": "Create a new storage bucket, and move the object you don't want to be checked anymore inside it. Then edit the bucket setting and enable the private attribute.",
      "C": "Add an appropriate lifecycle rule on the storage bucket containing the two objects."
    },
    "id": 119
  },
  {
    "answer": "A",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/36698-exam-professional-cloud-network-engineer-topic-1-question-52/",
    "question_text": "Your company offers a popular gaming service. Your instances are deployed with private IP addresses, and external access is granted through a global load balancer. You have recently engaged a traffic-scrubbing service and want to restrict your origin to allow connections only from the traffic-scrubbing service.\nWhat should you do?",
    "choices": {
      "A": "Create a Cloud Armor Security Policy that blocks all traffic except for the traffic-scrubbing service.",
      "C": "Create a VPC Service Control Perimeter that blocks all traffic except for the traffic-scrubbing service.",
      "D": "Create IPTables firewall rules that block all traffic except for the traffic-scrubbing service.",
      "B": "Create a VPC Firewall rule that blocks all traffic except for the traffic-scrubbing service."
    },
    "id": 120
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/36893-exam-professional-cloud-network-engineer-topic-1-question-53/",
    "question_text": "Your software team is developing an on-premises web application that requires direct connectivity to Compute Engine Instances in GCP using the RFC 1918 address space. You want to choose a connectivity solution from your on-premises environment to GCP, given these specifications:\n✑ Your ISP is a Google Partner Interconnect provider.\n✑ Your on-premises VPN device's internet uplink and downlink speeds are 10 Gbps.\n✑ A test VPN connection between your on-premises gateway and GCP is performing at a maximum speed of 500 Mbps due to packet losses.\n✑ Most of the data transfer will be from GCP to the on-premises environment.\n✑ The application can burst up to 1.5 Gbps during peak transfers over the Interconnect.\n✑ Cost and the complexity of the solution should be minimal.\nHow should you provision the connectivity solution?",
    "choices": {
      "C": "Create multiple VPN tunnels to account for the packet losses, and increase bandwidth using ECMP.",
      "B": "Provision a Dedicated Interconnect instead of a VPN.",
      "D": "Use network compression over your VPN to increase the amount of data you can send over your VPN.",
      "A": "Provision a Partner Interconnect through your ISP."
    },
    "id": 121
  },
  {
    "answer": "AB",
    "answer_ET": "BE",
    "url": "https://www.examtopics.com/discussions/google/view/36743-exam-professional-cloud-network-engineer-topic-1-question-54/",
    "question_text": "Your company has just launched a new critical revenue-generating web application. You deployed the application for scalability using managed instance groups, autoscaling, and a network load balancer as frontend. One day, you notice severe bursty traffic that the caused autoscaling to reach the maximum number of instances, and users of your application cannot complete transactions. After an investigation, you think it as a DDOS attack. You want to quickly restore user access to your application and allow successful transactions while minimizing cost.\nWhich two steps should you take? (Choose two.)",
    "choices": {
      "B": "Increase the maximum autoscaling backend to accommodate the severe bursty traffic.",
      "A": "Use Cloud Armor to blacklist the attacker's IP addresses.",
      "E": "SSH into the backend compute engine instances, and view the auth logs and syslogs to further understand the nature of the attack.",
      "C": "Create a global HTTP(s) load balancer and move your application backend to this load balancer.",
      "D": "Shut down the entire application in GCP for a few hours. The attack will stop when the application is offline."
    },
    "id": 122
  },
  {
    "answer": "AC",
    "answer_ET": "AC",
    "url": "https://www.examtopics.com/discussions/google/view/35872-exam-professional-cloud-network-engineer-topic-1-question-55/",
    "question_text": "You are creating a new application and require access to Cloud SQL from VPC instances without public IP addresses.\nWhich two actions should you take? (Choose two.)",
    "choices": {
      "A": "Activate the Service Networking API in your project.",
      "C": "Create a private connection to a service producer.",
      "E": "Enable Private Google Access.",
      "B": "Activate the Cloud Datastore API in your project.",
      "D": "Create a custom static route to allow the traffic to reach the Cloud SQL API."
    },
    "id": 123
  },
  {
    "answer": "D",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/36898-exam-professional-cloud-network-engineer-topic-1-question-56/",
    "question_text": "You want to use Cloud Interconnect to connect your on-premises network to a GCP VPC. You cannot meet Google at one of its point-of-presence (POP) locations, and your on-premises router cannot run a Border Gateway Protocol (BGP) configuration.\nWhich connectivity model should you use?",
    "choices": {
      "B": "Dedicated Interconnect",
      "A": "Direct Peering",
      "D": "Partner Interconnect with a layer 3 partner",
      "C": "Partner Interconnect with a layer 2 partner"
    },
    "id": 124
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/36744-exam-professional-cloud-network-engineer-topic-1-question-57/",
    "question_text": "You have configured a Compute Engine virtual machine instance as a NAT gateway. You execute the following command: gcloud compute routes create no-ip-internet-route \\\n--network custom-network1 \\\n--destination-range 0.0.0.0/0 \\\n--next-hop instance nat-gateway \\\n--next-hop instance-zone us-central1-a \\\n--tags no-ip --priority 800\nYou want existing instances to use the new NAT gateway.\nWhich command should you execute?",
    "choices": {
      "D": "gcloud compute instances create example-instance --network custom-network1 \\ --subnet subnet-us-central \\ --no-address \\ --zone us-central1-a \\ --image-family debian-9 \\ --image-project debian-cloud \\ --tags no-ip",
      "A": "sudo sysctl -w net.ipv4.ip_forward=1",
      "C": "gcloud builds submit --config=cloudbuild.waml --substitutions=TAG_NAME=no-ip",
      "B": "gcloud compute instances add-tags [existing-instance] --tags no-ip"
    },
    "id": 125
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/35930-exam-professional-cloud-network-engineer-topic-1-question-58/",
    "question_text": "You need to configure a static route to an on-premises resource behind a Cloud VPN gateway that is configured for policy-based routing using the gcloud command.\nWhich next hop should you choose?",
    "choices": {
      "C": "The name and region of the Cloud VPN tunnel",
      "D": "The IP address of the instance on the remote side of the VPN tunnel",
      "B": "The IP address of the Cloud VPN gateway",
      "A": "The default internet gateway"
    },
    "id": 126
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/36746-exam-professional-cloud-network-engineer-topic-1-question-59/",
    "question_text": "You need to enable Cloud CDN for all the objects inside a storage bucket. You want to ensure that all the object in the storage bucket can be served by the CDN.\nWhat should you do in the GCP Console?",
    "choices": {
      "D": "Create a new HTTP load balancer, select the storage bucket as a backend, enable Cloud CDN on the backend, and make sure each object inside the storage bucket is shared publicly.",
      "A": "Create a new cloud storage bucket, and then enable Cloud CDN on it.",
      "B": "Create a new TCP load balancer, select the storage bucket as a backend, and then enable Cloud CDN on the backend.",
      "C": "Create a new SSL proxy load balancer, select the storage bucket as a backend, and then enable Cloud CDN on the backend."
    },
    "id": 127
  },
  {
    "answer": "AD",
    "answer_ET": "CE",
    "url": "https://www.examtopics.com/discussions/google/view/19703-exam-professional-cloud-network-engineer-topic-1-question-6/",
    "question_text": "You are using a third-party next-generation firewall to inspect traffic. You created a custom route of 0.0.0.0/0 to route egress traffic to the firewall. You want to allow your VPC instances without public IP addresses to access the BigQuery and Cloud Pub/Sub APIs, without sending the traffic through the firewall.\nWhich two actions should you take? (Choose two.)",
    "choices": {
      "D": "Create a set of custom static routes to send traffic to the external IP addresses of Google APIs and services via the default internet gateway.",
      "E": "Create a set of custom static routes to send traffic to the internal IP addresses of Google APIs and services via the default internet gateway.",
      "B": "Turn on Private Google Access at the VPC level.",
      "A": "Turn on Private Google Access at the subnet level.",
      "C": "Turn on Private Services Access at the VPC level."
    },
    "id": 128
  },
  {
    "answer": "A",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/35938-exam-professional-cloud-network-engineer-topic-1-question-60/",
    "question_text": "Your company's Google Cloud-deployed, streaming application supports multiple languages. The application development team has asked you how they should support splitting audio and video traffic to different backend Google Cloud storage buckets. They want to use URL maps and minimize operational overhead. They are currently using the following directory structure:\n/fr/video\n/en/video\n/es/video\n/../video\n/fr/audio\n/en/audio\n/es/audio\n/../audio\nWhich solution should you recommend?",
    "choices": {
      "C": "Leave the directory structure as-is, create a URL map and leverage a path rule such as \\/[a-z]{2}\\/video and \\/[a-z]{2}\\/audio.",
      "A": "Rearrange the directory structure, create a URL map and leverage a path rule such as /video/* and /audio/*.",
      "D": "Leave the directory structure as-is, create a URL map and leverage a path rule such as /*/video and /*/audio.",
      "B": "Rearrange the directory structure, create DNS hostname entries for video and audio and leverage a path rule such as /video/* and /audio/*."
    },
    "id": 129
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/36748-exam-professional-cloud-network-engineer-topic-1-question-61/",
    "question_text": "You want to establish a dedicated connection to Google that can access Cloud SQL via a public IP address and that does not require a third-party service provider.\nWhich connection type should you choose?",
    "choices": {
      "A": "Carrier Peering",
      "B": "Direct Peering",
      "D": "Partner Interconnect",
      "C": "Dedicated Interconnect"
    },
    "id": 130
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/36750-exam-professional-cloud-network-engineer-topic-1-question-62/",
    "question_text": "You are configuring a new instance of Cloud Router in your Organization's Google Cloud environment to allow connection across a new Dedicated Interconnect to your data center Sales, Marketing, and IT each have a service project attached to the Organization's host project.\nWhere should you create the Cloud Router instance?",
    "choices": {
      "D": "VPC network in the Sales, Marketing, and IT Projects",
      "B": "VPC network in the IT Project",
      "A": "VPC network in all projects",
      "C": "VPC network in the Host Project"
    },
    "id": 131
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/36751-exam-professional-cloud-network-engineer-topic-1-question-63/",
    "question_text": "You created a new VPC for your development team. You want to allow access to the resources in this VPC via SSH only.\nHow should you configure your firewall rules?",
    "choices": {
      "B": "Create two firewall rules: one to block all traffic with priority 65536, and another to allow port 3389 with priority 1000.",
      "C": "Create a single firewall rule to allow port 22 with priority 1000.",
      "D": "Create a single firewall rule to allow port 3389 with priority 1000.",
      "A": "Create two firewall rules: one to block all traffic with priority 0, and another to allow port 22 with priority 1000."
    },
    "id": 132
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/35940-exam-professional-cloud-network-engineer-topic-1-question-64/",
    "question_text": "Your on-premises data center has 2 routers connected to your GCP through a VPN on each router. All applications are working correctly; however, all of the traffic is passing across a single VPN instead of being load-balanced across the 2 connections as desired.\nDuring troubleshooting you find:\n\"¢ Each on-premises router is configured with the same ASN.\n\"¢ Each on-premises router is configured with the same routes and priorities.\n\"¢ Both on-premises routers are configured with a VPN connected to a single Cloud Router.\n\"¢ The VPN logs have no-proposal-chosen lines when the VPNs are connecting.\n\"¢ BGP session is not established between one on-premises router and the Cloud Router.\nWhat is the most likely cause of this problem?",
    "choices": {
      "C": "You do not have a load balancer to load-balance the network traffic.",
      "D": "BGP sessions are not established between both on-premises routers and the Cloud Router.",
      "B": "A firewall is blocking the traffic across the second VPN connection.",
      "A": "One of the VPN sessions is configured incorrectly."
    },
    "id": 133
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/36752-exam-professional-cloud-network-engineer-topic-1-question-65/",
    "question_text": "You need to define an address plan for a future new GKE cluster in your VPC. This will be a VPC native cluster, and the default Pod IP range allocation will be used. You must pre-provision all the needed VPC subnets and their respective IP address ranges before cluster creation. The cluster will initially have a single node, but it will be scaled to a maximum of three nodes if necessary. You want to allocate the minimum number of Pod IP addresses.\nWhich subnet mask should you use for the Pod IP address range?",
    "choices": {
      "C": "/23",
      "D": "/25",
      "B": "/22",
      "A": "/21"
    },
    "id": 134
  },
  {
    "answer": "D",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/35949-exam-professional-cloud-network-engineer-topic-1-question-66/",
    "question_text": "You have created a firewall with rules that only allow traffic over HTTP, HTTPS, and SSH ports. While testing, you specifically try to reach the server over multiple ports and protocols; however, you do not see any denied connections in the firewall logs. You want to resolve the issue.\nWhat should you do?",
    "choices": {
      "D": "Create an explicit Deny Any rule and enable logging on the new rule.",
      "A": "Enable logging on the default Deny Any Firewall Rule.",
      "C": "Create a logging sink forwarding all firewall logs with no filters.",
      "B": "Enable logging on the VM Instances that receive traffic."
    },
    "id": 135
  },
  {
    "answer": "BD",
    "answer_ET": "CE",
    "url": "https://www.examtopics.com/discussions/google/view/36754-exam-professional-cloud-network-engineer-topic-1-question-67/",
    "question_text": "In your company, two departments with separate GCP projects (code-dev and data-dev) in the same organization need to allow full cross-communication between all of their virtual machines in GCP. Each department has one VPC in its project and wants full control over their network. Neither department intends to recreate its existing computing resources. You want to implement a solution that minimizes cost.\nWhich two steps should you take? (Choose two.)",
    "choices": {
      "C": "Enable Shared VPC in one project (e. g., code-dev), and make the second project (e. g., data-dev) a service project.",
      "D": "Enable firewall rules to allow all ingress traffic from all subnets of project code-dev to all instances in project data-dev, and vice versa.",
      "E": "Create a route in the code-dev project to the destination prefixes in project data-dev and use nexthop as the default gateway, and vice versa.",
      "A": "Connect both projects using Cloud VPN.",
      "B": "Connect the VPCs in project code-dev and data-dev using VPC Network Peering."
    },
    "id": 136
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/35951-exam-professional-cloud-network-engineer-topic-1-question-68/",
    "question_text": "You need to create a GKE cluster in an existing VPC that is accessible from on-premises. You must meet the following requirements:\n✑ IP ranges for pods and services must be as small as possible.\n✑ The nodes and the master must not be reachable from the internet.\n✑ You must be able to use kubectl commands from on-premises subnets to manage the cluster.\nHow should you create the GKE cluster?",
    "choices": {
      "D": "\"¢ Create a VPC-native GKE cluster using user-managed IP ranges. \"¢ Enable privateEndpoint on the cluster master. \"¢ Set the pod and service ranges as /24. \"¢ Set up a network proxy to access the master. \"¢ Enable master authorized networks.",
      "A": "\"¢ Create a private cluster that uses VPC advanced routes. \"¢ Set the pod and service ranges as /24. \"¢ Set up a network proxy to access the master.",
      "B": "\"¢ Create a VPC-native GKE cluster using GKE-managed IP ranges. \"¢ Set the pod IP range as /21 and service IP range as /24. \"¢ Set up a network proxy to access the master.",
      "C": "\"¢ Create a VPC-native GKE cluster using user-managed IP ranges. \"¢ Enable a GKE cluster network policy, set the pod and service ranges as /24. \"¢ Set up a network proxy to access the master. \"¢ Enable master authorized networks."
    },
    "id": 137
  },
  {
    "answer": "AC",
    "answer_ET": "AE",
    "url": "https://www.examtopics.com/discussions/google/view/36634-exam-professional-cloud-network-engineer-topic-1-question-69/",
    "question_text": "You are creating an instance group and need to create a new health check for HTTP(s) load balancing.\nWhich two methods can you use to accomplish this? (Choose two.)",
    "choices": {
      "C": "Create a new health check, or select an existing one, when you complete the load balancer's backend configuration in the GCP Console.",
      "B": "Create a new health check using the VPC Network section in the GCP Console.",
      "D": "Create a new legacy health check using the gcloud command line tool.",
      "E": "Create a new legacy health check using the Health checks section in the GCP Console.",
      "A": "Create a new health check using the gcloud command line tool."
    },
    "id": 138
  },
  {
    "answer": "A",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/26023-exam-professional-cloud-network-engineer-topic-1-question-7/",
    "question_text": "All the instances in your project are configured with the custom metadata enable-oslogin value set to FALSE and to block project-wide SSH keys. None of the instances are set with any SSH key, and no project-wide SSH keys have been configured. Firewall rules are set up to allow SSH sessions from any IP address range. You want to SSH into one instance.\nWhat should you do?",
    "choices": {
      "A": "Open the Cloud Shell SSH into the instance using gcloud compute ssh.",
      "B": "Set the custom metadata enable-oslogin to TRUE, and SSH into the instance using a third-party tool like putty or ssh.",
      "C": "Generate a new SSH key pair. Verify the format of the private key and add it to the instance. SSH into the instance using a third-party tool like putty or ssh.",
      "D": "Generate a new SSH key pair. Verify the format of the public key and add it to the project. SSH into the instance using a third-party tool like putty or ssh."
    },
    "id": 139
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/36761-exam-professional-cloud-network-engineer-topic-1-question-70/",
    "question_text": "You are in the early stages of planning a migration to GCP. You want to test the functionality of your hybrid cloud design before you start to implement it in production. The design includes services running on a Compute Engine Virtual Machine instance that need to communicate to on-premises servers using private\nIP addresses. The on-premises servers have connectivity to the internet, but you have not yet established any Cloud Interconnect connections. You want to choose the lowest cost method of enabling connectivity between your instance and on-premises servers and complete the test in 24 hours.\nWhich connectivity method should you choose?",
    "choices": {
      "A": "Cloud VPN",
      "D": "Dedicated Interconnect, but don't provision any VLAN attachments",
      "C": "Dedicated Interconnect with a single VLAN attachment",
      "B": "50-Mbps Partner VLAN attachment"
    },
    "id": 140
  },
  {
    "answer": "C",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/36636-exam-professional-cloud-network-engineer-topic-1-question-71/",
    "question_text": "You want to implement an IPSec tunnel between your on-premises network and a VPC via Cloud VPN. You need to restrict reachability over the tunnel to specific local subnets, and you do not have a device capable of speaking Border Gateway Protocol (BGP).\nWhich routing option should you choose?",
    "choices": {
      "D": "Policy-based routing using the default local traffic selector",
      "B": "Route-based routing using default traffic selectors",
      "A": "Dynamic routing using Cloud Router",
      "C": "Policy-based routing using a custom local traffic selector"
    },
    "id": 141
  },
  {
    "answer": "AE",
    "answer_ET": "AD",
    "url": "https://www.examtopics.com/discussions/google/view/36762-exam-professional-cloud-network-engineer-topic-1-question-72/",
    "question_text": "You have enabled HTTP(S) load balancing for your application, and your application developers have reported that HTTP(S) requests are not being distributed correctly to your Compute Engine Virtual Machine instances. You want to find data about how the request are being distributed.\nWhich two methods can accomplish this? (Choose two.)",
    "choices": {
      "B": "In Stackdriver Error Reporting, look for any unacknowledged errors for the Cloud Load Balancers service.",
      "C": "In Stackdriver Monitoring, select Resources > Metrics Explorer and search for https/request_bytes_count metric.",
      "E": "In Stackdriver Monitoring, create a new dashboard and track the https/backend_request_count metric for the load balancer.",
      "A": "On the Load Balancer details page of the GCP Console, click on the Monitoring tab, select your backend service, and look at the graphs.",
      "D": "In Stackdriver Monitoring, select Resources > Google Cloud Load Balancers and review the Key Metrics graphs in the dashboard."
    },
    "id": 142
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/35958-exam-professional-cloud-network-engineer-topic-1-question-73/",
    "question_text": "You want to use Partner Interconnect to connect your on-premises network with your VPC. You already have an Interconnect partner.\nWhat should you first?",
    "choices": {
      "A": "Log in to your partner's portal and request the VLAN attachment there.",
      "C": "Create a Partner Interconnect type VLAN attachment in the GCP Console and retrieve the pairing key.",
      "B": "Ask your Interconnect partner to provision a physical connection to Google.",
      "D": "Run gcloud compute interconnect attachments partner update <attachment> / --region <region> --admin-enabled."
    },
    "id": 143
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/36763-exam-professional-cloud-network-engineer-topic-1-question-74/",
    "question_text": "You need to centralize the Identity and Access Management permissions and email distribution for the WebServices Team as efficiently as possible.\nWhat should you do?",
    "choices": {
      "C": "Create a new Cloud Identity Domain for the WebServices Team.",
      "A": "Create a Google Group for the WebServices Team.",
      "B": "Create a G Suite Domain for the WebServices Team.",
      "D": "Create a new Custom Role for all members of the WebServices Team."
    },
    "id": 144
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/36764-exam-professional-cloud-network-engineer-topic-1-question-75/",
    "question_text": "You are using the gcloud command line tool to create a new custom role in a project by coping a predefined role. You receive this error message:\nINVALID_ARGUMENT: Permission resourcemanager.projects.list is not valid\nWhat should you do?",
    "choices": {
      "A": "Add the resourcemanager.projects.get permission, and try again.",
      "B": "Try again with a different role with a new name but the same permissions.",
      "D": "Add the resourcemanager.projects.setIamPolicy permission, and try again.",
      "C": "Remove the resourcemanager.projects.list permission, and try again."
    },
    "id": 145
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/36765-exam-professional-cloud-network-engineer-topic-1-question-76/",
    "question_text": "One instance in your VPC is configured to run with a private IP address only. You want to ensure that even if this instance is deleted, its current private IP address will not be automatically assigned to a different instance.\nIn the GCP Console, what should you do?",
    "choices": {
      "D": "Add custom metadata to the instance with key internal-address and value reserved.",
      "A": "Assign a public IP address to the instance.",
      "C": "Change the instance's current internal IP address to static.",
      "B": "Assign a new reserved internal IP address to the instance."
    },
    "id": 146
  },
  {
    "answer": "B",
    "answer_ET": "D",
    "url": "https://www.examtopics.com/discussions/google/view/36409-exam-professional-cloud-network-engineer-topic-1-question-77/",
    "question_text": "After a network change window one of your company's applications stops working. The application uses an on-premises database server that no longer receives any traffic from the application. The database server IP address is 10.2.1.25. You examine the change request, and the only change is that 3 additional VPC subnets were created. The new VPC subnets created are 10.1.0.0/16, 10.2.0.0/16, and 10.3.1.0/24/ The on-premises router is advertising 10.0.0.0/8.\nWhat is the most likely cause of this problem?",
    "choices": {
      "D": "A cloud firewall rule that blocks traffic to the on-premises database server was created during the change.",
      "C": "The on-premises router is not advertising a route for the database server.",
      "B": "The more specific VPC subnet route is taking priority.",
      "A": "The less specific VPC subnet route is taking priority."
    },
    "id": 147
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/36408-exam-professional-cloud-network-engineer-topic-1-question-78/",
    "question_text": "You need to create a new VPC network that allows instances to have IP addresses in both the 10.1.1.0/24 network and the 172.16.45.0/24 network.\nWhat should you do?",
    "choices": {
      "D": "Use VPC peering to allow traffic to route between the 10.1.0.0/24 network and the 172.16.45.0/24 network.",
      "B": "Create unique DNS records for each service that sends traffic to the desired IP address.",
      "A": "Configure global load balancing to point 172.16.45.0/24 to the correct instance.",
      "C": "Configure an alias-IP range of 172.16.45.0/24 on the virtual instances within the VPC subnet of 10.1.1.0/24."
    },
    "id": 148
  },
  {
    "answer": "D",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/36771-exam-professional-cloud-network-engineer-topic-1-question-79/",
    "question_text": "You are deploying a global external TCP load balancing solution and want to preserve the source IP address of the original layer 3 payload.\nWhich type of load balancer should you use?",
    "choices": {
      "A": "HTTP(S) load balancer",
      "D": "TCP/SSL proxy load balancer",
      "B": "Network load balancer",
      "C": "Internal load balancer"
    },
    "id": 149
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/19709-exam-professional-cloud-network-engineer-topic-1-question-8/",
    "question_text": "You work for a university that is migrating to GCP.\nThese are the cloud requirements:\n\"¢ On-premises connectivity with 10 Gbps\n\"¢ Lowest latency access to the cloud\n\"¢ Centralized Networking Administration Team\nNew departments are asking for on-premises connectivity to their projects. You want to deploy the most cost-efficient interconnect solution for connecting the campus to Google Cloud.\nWhat should you do?",
    "choices": {
      "C": "Use standalone projects, and deploy the VLAN attachments in the individual projects. Connect the VLAN attachment to the standalone projects' Interconnects.",
      "D": "Use standalone projects and deploy the VLAN attachments and Interconnects in each of the individual projects.",
      "B": "Use Shared VPC, and deploy the VLAN attachments in the service projects. Connect the VLAN attachment to the Shared VPC's host project.",
      "A": "Use Shared VPC, and deploy the VLAN attachments and Interconnect in the host project."
    },
    "id": 150
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89453-exam-professional-cloud-network-engineer-topic-1-question-80/",
    "question_text": "Your company has a single Virtual Private Cloud (VPC) network deployed in Google Cloud with access from your on-premises network using Cloud Interconnect. You must configure access only to Google APIs and services that are supported by VPC Service Controls through hybrid connectivity with a service level agreement (SLA) in place. What should you do?",
    "choices": {
      "A": "Configure the existing Cloud Routers to advertise the Google API's public virtual IP addresses.",
      "D": "Add Direct Peering links, and use them for connectivity to Google APIs that use public virtual IP addresses.",
      "C": "Configure the existing Cloud Routers to advertise a default route, and use Cloud NAT to translate traffic from your on-premises network.",
      "B": "Use Private Google Access for on-premises hosts with restricted.googleapis.com virtual IP addresses."
    },
    "id": 151
  },
  {
    "answer": "B",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89452-exam-professional-cloud-network-engineer-topic-1-question-81/",
    "question_text": "Your company's security team tends to use managed services when possible. You need to build a dashboard to show the number of deny hits that occur against configured firewall rules without increasing operational overhead. What should you do?",
    "choices": {
      "D": "Configure Packet Mirroring on the VPC. Apply a filter with an IP address list of the Denied Firewall rules. Configure an intrusion detection system (IDS) appliance as the receiver to display the number of hits.",
      "C": "Configure a firewall appliance from the Google Cloud Marketplace. Route all traffic through this appliance, and apply the firewall rules at this layer. Use the firewall appliance to display the number of hits.",
      "A": "Configure Firewall Rules Logging. Use Firewall Insights to display the number of hits.",
      "B": "Configure Firewall Rules Logging. View the logs in Cloud Logging, and create a custom dashboard in Cloud Monitoring to display the number of hits."
    },
    "id": 152
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89470-exam-professional-cloud-network-engineer-topic-1-question-82/",
    "question_text": "You are configuring your Google Cloud environment to connect to your on-premises network. Your configuration must be able to reach Cloud Storage APIs and your Google Kubernetes Engine nodes across your private Cloud Interconnect network. You have already configured a Cloud Router with your Interconnect VLAN attachments. You now need to set up the appropriate router advertisement configuration on the Cloud Router. What should you do?",
    "choices": {
      "B": "On the on-premises router, configure a static route for the storage API virtual IP address which points to the Cloud Router's link-local IP address.",
      "D": "Configure the route advertisement to the custom setting, and manually add prefix 199.36.153.8/30 to the list of advertisements. Advertise all visible subnets to the Cloud Router.",
      "A": "Configure the route advertisement to the default setting.",
      "C": "Configure the route advertisement to the custom setting, and manually add prefix 199.36.153.8/30 to the list of advertisements. Leave all other options as their default settings."
    },
    "id": 153
  },
  {
    "answer": "C",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89263-exam-professional-cloud-network-engineer-topic-1-question-83/",
    "question_text": "You are configuring load balancing for a standard three-tier (web, application, and database) application. You have configured an external HTTP(S) load balancer for the web servers. You need to configure load balancing for the application tier of servers. What should you do?",
    "choices": {
      "A": "Configure a forwarding rule on the existing load balancer for the application tier.",
      "B": "Configure equal cost multi-path routing on the application servers.",
      "C": "Configure a new internal HTTP(S) load balancer for the application tier.",
      "D": "Configure a URL map on the existing load balancer to route traffic to the application tier."
    },
    "id": 154
  },
  {
    "answer": "C",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/89264-exam-professional-cloud-network-engineer-topic-1-question-84/",
    "question_text": "Your organization has a new security policy that requires you to monitor all egress traffic payloads from your virtual machines in region us-west2. You deployed an intrusion detection system (IDS) virtual appliance in the same region to meet the new policy. You now need to integrate the IDS into the environment to monitor all egress traffic payloads from us-west2. What should you do?",
    "choices": {
      "A": "Enable firewall logging, and forward all filtered egress firewall logs to the IDS.",
      "D": "Create an internal HTTP(S) load balancer for Packet Mirroring, and add a packet mirroring policy filter for egress traffic.",
      "B": "Enable VPC Flow Logs. Create a sink in Cloud Logging to send filtered egress VPC Flow Logs to the IDS.",
      "C": "Create an internal TCP/UDP load balancer for Packet Mirroring, and add a packet mirroring policy filter for egress traffic."
    },
    "id": 155
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89550-exam-professional-cloud-network-engineer-topic-1-question-85/",
    "question_text": "You are developing an HTTP API hosted on a Compute Engine virtual machine instance that must be invoked only by multiple clients within the same Virtual Private Cloud (VPC). You want clients to be able to get the IP address of the service. What should you do?",
    "choices": {
      "C": "Reserve a static external IP address and assign it to an HTTP(S) load balancing service's forwarding rule. Then, define an A record in Cloud DNS. Clients should use the name of the A record to connect to the service.",
      "D": "Ensure that clients use Compute Engine internal DNS by connecting to the instance name with the url https://[API_NAME]/[API_VERSION]/.",
      "A": "Reserve a static external IP address and assign it to an HTTP(S) load balancing service's forwarding rule. Clients should use this IP address to connect to the service.",
      "B": "Ensure that clients use Compute Engine internal DNS by connecting to the instance name with the url https://[INSTANCE_NAME].[ZONE].c.[PROJECT_ID].internal/."
    },
    "id": 156
  },
  {
    "answer": "B",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89573-exam-professional-cloud-network-engineer-topic-1-question-86/",
    "question_text": "You recently deployed Cloud VPN to connect your on-premises data canter to Google Cloud. You need to monitor the usage of this VPN and set up alerts in case traffic exceeds the maximum allowed. You need to be able to quickly decide whether to add extra links or move to a Dedicated Interconnect. What should you do?",
    "choices": {
      "A": "In the Network Intelligence Canter, check for the number of packet drops on the VPN.",
      "D": "In the VPN section of the Google Cloud Console, select the VPN under hybrid connectivity, and then select monitoring to display utilization on the dashboard.",
      "B": "In the Google Cloud Console, use Monitoring Query Language to create a custom alert for bandwidth utilization.",
      "C": "In the Monitoring section of the Google Cloud Console, use the Dashboard section to select a default dashboard for VPN usage."
    },
    "id": 157
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89474-exam-professional-cloud-network-engineer-topic-1-question-87/",
    "question_text": "You have applications running in the us-west1 and us-east1 regions. You want to build a highly available VPN that provides 99.99% availability to connect your applications from your project to the cloud services provided by your partner's project while minimizing the amount of infrastructure required. Your partner's services are also in the us-west1 and us-east1 regions. You want to implement the simplest solution. What should you do?",
    "choices": {
      "A": "Create one Cloud Router and one HA VPN gateway in each region of your VPC and your partner's VPC. Connect your VPN gateways to the partner's gateways. Enable global dynamic routing in each VPC.",
      "B": "Create one Cloud Router and one HA VPN gateway in the us-west1 region of your VPC. Create one OpenVPN Access Server in each region of your partner's VPC. Connect your VPN gateway to your partner's servers.",
      "D": "Create one Cloud Router and one HA VPN gateway in the us-west1 region of your VPC and your partner's VPC. Connect your VPN gateways to the partner's gateways with a pair of tunnels. Enable global dynamic routing in each VPC.",
      "C": "Create one OpenVPN Access Server in each region of your VPC and your partner's VPConnect your servers to the partner's servers."
    },
    "id": 158
  },
  {
    "answer": "B",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89551-exam-professional-cloud-network-engineer-topic-1-question-88/",
    "question_text": "You need to create the network infrastructure to deploy a highly available web application in the us-east1 and us-west1 regions. The application runs on Compute Engine instances, and it does not require the use of a database. You want to follow Google-recommended practices. What should you do?",
    "choices": {
      "C": "Create one VPC in each region, and peer both VPCs.\nCreate a global load balancer.\nEnable Cloud CDN on the load balancer.\nCreate a CNAME for the load balancer in Cloud DNS.",
      "A": "Create one VPC with one subnet in each region.\nCreate a regional network load balancer in each region with a static IP address.\nEnable Cloud CDN on the load balancers.\nCreate an A record in Cloud DNS with both IP addresses for the load balancers.",
      "D": "Create one VPC with one subnet in each region.\nCreate an HTTP(S) load balancer with a static IP address.\nChoose the standard tier for the network.\nEnable Cloud CDN on the load balancer.\nCreate a CNAME record using the load balancer’s IP address in Cloud DNS.",
      "B": "Create one VPC with one subnet in each region.\nCreate a global load balancer with a static IP address.\nEnable Cloud CDN and Google Cloud Armor on the load balancer.\nCreate an A record using the IP address of the load balancer in Cloud DNS."
    },
    "id": 159
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89720-exam-professional-cloud-network-engineer-topic-1-question-89/",
    "question_text": "You are the network administrator responsible for hybrid connectivity at your organization. Your developer team wants to use Cloud SQL in the us-west1 region in your Shared VPC. You configured a Dedicated Interconnect connection and a Cloud Router in us-west1, and the connectivity between your Shared VPC and on-premises data center is working as expected. You just created the private services access connection required for Cloud SQL using the reserved IP address range and default settings. However, your developers cannot access the Cloud SQL instance from on-premises. You want to resolve the issue. What should you do?",
    "choices": {
      "D": "1. Change the VPC routing mode to global.\n2. Modify the VPC Network Peering connection used for Cloud SQL, and enable the import and export of routes.",
      "A": "1. Modify the VPC Network Peering connection used for Cloud SQL, and enable the import and export of routes.\n2. Create a custom route advertisement in your Cloud Router to advertise the Cloud SQL IP address range.",
      "C": "1. Create an additional Cloud Router in us-west2.\n2. Create a new Border Gateway Protocol (BGP) peering connection to your on-premises data center.\n3. Modify the VPC Network Peering connection used for Cloud SQL, and enable the import and export of routes.",
      "B": "1. Change the VPC routing mode to global.\n2. Create a custom route advertisement in your Cloud Router to advertise the Cloud SQL IP address range."
    },
    "id": 160
  },
  {
    "answer": "B",
    "answer_ET": "B",
    "url": "https://www.examtopics.com/discussions/google/view/23472-exam-professional-cloud-network-engineer-topic-1-question-9/",
    "question_text": "You have deployed a new internal application that provides HTTP and TFTP services to on-premises hosts. You want to be able to distribute traffic across multiple\nCompute Engine instances, but need to ensure that clients are sticky to a particular instance across both services.\nWhich session affinity should you choose?",
    "choices": {
      "D": "Client IP, port and protocol",
      "B": "Client IP",
      "A": "None",
      "C": "Client IP and protocol"
    },
    "id": 161
  },
  {
    "answer": "D",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89721-exam-professional-cloud-network-engineer-topic-1-question-90/",
    "question_text": "Your company has separate Virtual Private Cloud (VPC) networks in a single region for two departments: Sales and Finance. The Sales department's VPC network already has connectivity to on-premises locations using HA VPN, and you have confirmed that the subnet ranges do not overlap. You plan to peer both VPC networks to use the same HA tunnels for on-premises connectivity, while providing internet connectivity for the Google Cloud workloads through Cloud NAT. Internet access from the on-premises locations should not flow through Google Cloud. You need to propagate all routes between the Finance department and on-premises locations. What should you do?",
    "choices": {
      "C": "Peer the two VPCs. Configure VPC Network Peering to export custom routes from Sales and import custom routes on Finance's VPC network. Use Cloud Router’s custom route advertisements to announce a default route to the on-premises locations.",
      "B": "Peer the two VPCs, and use Cloud Router’s custom route advertisements to announce the peered VPC network ranges to the on-premises locations.",
      "D": "Peer the two VPCs. Configure VPC Network Peering to export custom routes from Sales and import custom routes on Finance's VPC network. Use Cloud Router’s custom route advertisements to announce the peered VPC network ranges to the on-premises locations.",
      "A": "Peer the two VPCs, and use the default configuration for the Cloud Routers."
    },
    "id": 162
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89591-exam-professional-cloud-network-engineer-topic-1-question-91/",
    "question_text": "You recently noticed a recurring daily spike in network usage in your Google Cloud project. You need to identify the virtual machine (VM) instances and type of traffic causing the spike in traffic utilization while minimizing the cost and management overhead required. What should you do?",
    "choices": {
      "D": "Deploy a third-party network appliance and configure it as the default gateway. Use the third-party network appliance to identify users with high network traffic.",
      "A": "Enable VPC Flow Logs and send the output to BigQuery for analysis.",
      "B": "Enable Firewall Rules Logging for all allowed traffic and send the output to BigQuery for analysis.",
      "C": "Configure Packet Mirroring to send all traffic to a VM. Use Wireshark on the VM to identity traffic utilization for each VM in the VPC."
    },
    "id": 163
  },
  {
    "answer": "A",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89553-exam-professional-cloud-network-engineer-topic-1-question-92/",
    "question_text": "You need to enable Private Google Access for use by some subnets within your Virtual Private Cloud (VPC). Your security team set up the VPC to send all internet-bound traffic back to the on- premises data center for inspection before egressing to the internet, and is also implementing VPC Service Controls in the environment for API-level security control. You have already enabled the subnets for Private Google Access. What configuration changes should you make to enable Private Google Access while adhering to your security team’s requirements?",
    "choices": {
      "D": "1. Create a private DNS zone with a CNAME record for *.googleapis.com to private.googleapis.com, with an A record pointing to Google's private API address range.\n2. Create a custom route that points Google's private API address range to the default internet gateway as the next hop.",
      "B": "1. Create a private DNS zone with a CNAME record for *.googleapis.com to restricted.googleapis.com, with an A record pointing to Google's restricted API address range.\n2. Change the custom route that points the default route (0/0) to the default internet gateway as the next hop.",
      "A": "1. Create a private DNS zone with a CNAME record for *.googleapis.com to restricted.googleapis.com, with an A record pointing to Google's restricted API address range.\n2. Create a custom route that points Google's restricted API address range to the default internet gateway as the next hop.",
      "C": "1. Create a private DNS zone with a CNAME record for *.googleapis.com to private.googleapis.com, with an A record painting to Google's private AP address range.\n2. Change the custom route that points the default route (0/0) to the default internet gateway as the next hop."
    },
    "id": 164
  },
  {
    "answer": "C",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89593-exam-professional-cloud-network-engineer-topic-1-question-93/",
    "question_text": "You have deployed an HTTP(s) load balancer, but health checks to port 80 on the Compute Engine virtual machine instance are failing, and no traffic is sent to your instances. You want to resolve the problem. Which commands should you run?",
    "choices": {
      "D": "gcloud compute health-checks update http health-check --unhealthy-threshold 10",
      "C": "gcloud compute firewall-rules create allow-lb --network load-balancer --allow tcp --source-ranges 130.211.0.0/22,35.191.0.0/16 --direction INGRESS",
      "A": "gcloud compute instances add-access-config instance-1",
      "B": "gcloud compute firewall-rules create allow-lb --network load-balancer --allow tcp --destination-ranges 130.211.0.0/22,35.191.0.0/16 --direction EGRESS"
    },
    "id": 165
  },
  {
    "answer": "D",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89724-exam-professional-cloud-network-engineer-topic-1-question-94/",
    "question_text": "You deployed a hub-and-spoke architecture in your Google Cloud environment that uses VPC Network Peering to connect the spokes to the hub. For security reasons, you deployed a private Google Kubernetes Engine (GKE) cluster in one of the spoke projects with a private endpoint for the control plane. You configured authorized networks to be the subnet range where the GKE nodes are deployed. When you attempt to reach the GKE control plane from a different spoke project, you cannot access it. You need to allow access to the GKE control plane from the other spoke projects. What should you do?",
    "choices": {
      "B": "Enable Private Google Access on the subnet where the GKE nodes are deployed.",
      "A": "Add a firewall rule that allows port 443 from the other spoke projects.",
      "D": "Deploy a proxy in the spoke project where the GKE nodes are deployed and connect to the control plane through the proxy.",
      "C": "Configure the authorized networks to be the subnet ranges of the other spoke projects."
    },
    "id": 166
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89594-exam-professional-cloud-network-engineer-topic-1-question-95/",
    "question_text": "You recently deployed your application in Google Cloud. You need to verify your Google Cloud network configuration before deploying your on-premises workloads. You want to confirm that your Google Cloud network configuration allows traffic to flow from your cloud resources to your on- premises network. This validation should also analyze and diagnose potential failure points in your Google Cloud network configurations without sending any data plane test traffic. What should you do?",
    "choices": {
      "B": "Enable Packet Mirroring on your application and send test traffic.",
      "D": "Enable VPC Flow Logs and send test traffic.",
      "C": "Use Network Intelligence Center's Network Topology visualizations.",
      "A": "Use Network Intelligence Center's Connectivity Tests."
    },
    "id": 167
  },
  {
    "answer": "A",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89725-exam-professional-cloud-network-engineer-topic-1-question-96/",
    "question_text": "In your Google Cloud organization, you have two folders: Dev and Prod. You want a scalable and consistent way to enforce the following firewall rules for all virtual machines (VMs) with minimal cost:\n\n• Port 8080 should always be open for VMs in the projects in the Dev folder.\n• Any traffic to port 8080 should be denied for all VMs in your projects in the Prod folder.\n",
    "choices": {
      "B": "Create a Shared VPC for the Dev projects and a Shared VPC for the Prod projects. Create a VPC firewall rule to open port 8080 in the Shared VPC for Dev. Create a firewall rule to deny traffic to port 8080 in the Shared VPC for Prod. Deploy VMs to those Shared VPCs.",
      "D": "Use Anthos Config Connector to enforce a security policy to open port 8080 on the Dev VMs and deny traffic to port 8080 on the Prod VMs.",
      "C": "In all VPCs for the Dev projects, create a VPC firewall rule to open port 8080. In all VPCs for the Prod projects, create a VPC firewall rule to deny traffic to port 8080.",
      "A": "Create and associate a firewall policy with the Dev folder with a rule to open port 8080. Create and associate a firewall policy with the Prod folder with a rule to deny traffic to port 8080."
    },
    "id": 168
  },
  {
    "answer": "C",
    "answer_ET": "C",
    "url": "https://www.examtopics.com/discussions/google/view/89472-exam-professional-cloud-network-engineer-topic-1-question-97/",
    "question_text": "You need to configure the Border Gateway Protocol (BGP) session for a VPN tunnel you just created between two Google Cloud VPCs, 10.1.0.0/16 and 172.16.0.0/16. You have a Cloud Router (router-1) in the 10.1.0.0/16 network and a second Cloud Router (router-2) in the 172.16.0.0/16 network. Which configuration should you use for the BGP session?",
    "choices": {
      "D": "",
      "B": "",
      "A": "",
      "C": ""
    },
    "id": 169
  },
  {
    "answer": "C",
    "answer_ET": "A",
    "url": "https://www.examtopics.com/discussions/google/view/89726-exam-professional-cloud-network-engineer-topic-1-question-98/",
    "question_text": "Your company’s on-premises network is connected to a VPC using a Cloud VPN tunnel. You have a static route of 0.0.0.0/0 with the VPN tunnel as its next hop defined in the VPC. All internet bound traffic currently passes through the on-premises network. You configured Cloud NAT to translate the primary IP addresses of Compute Engine instances in one region. Traffic from those instances will now reach the internet directly from their VPC and not from the on-premises network. Traffic from the virtual machines (VMs) is not translating addresses as expected. What should you do?",
    "choices": {
      "D": "Increase the default min-ports-per-vm setting for the Cloud NAT gateway.",
      "C": "Add a default static route to the VPC with the default internet gateway as the next hop, the network tag associated with the Compute Engine instances, and a higher priority than the priority of the default route to the VPN tunnel.",
      "B": "Add firewall rules that allow ingress and egress of the external NAT IP address, have a target tag that is on the Compute Engine instances, and have a priority value higher than the priority value of the default route to the VPN gateway.",
      "A": "Lower the TCP Established Connection Idle Timeout for the NAT gateway."
    },
    "id": 170
  }
]